[
    {"name":"Australian.Curriculum.English","size":3938,"imports":[
            "Australian.Curriculum.Mathematics"
        ],"description":[
            "The Australian Curriculum in English includes:",
            "The Foundation to Year 10 Australian Curriculum: English",
            "The senior secondary subjects of English, English as an Additional Language or Dialect, Essential English and Literature.",
            "The study of English is central to the learning and development of all young Australians. It helps create confident communicators, imaginative thinkers and informed citizens. It is through the study of English that individuals learn to analyse, understand, communicate and build relationships with others and with the world around them. The study of English plays a key role in the development of reading and literacy skills which help young people develop the knowledge and skills needed for education, training and the workplace. It helps them become ethical, thoughtful, informed and active members of society."    
        ]
    },
    {"name":"Australian.Curriculum.Mathematics","size":3812,"imports":[
            "Australian.Curriculum.Science"
        ],"description":[
            "The Australian Curriculum in Mathematics includes:",
            "The Foundation to Year 10 Australian Curriculum: Mathematics",
            "The senior secondary subjects of Essential Mathematics, General Mathematics, Mathematical Methods, Specialist Mathematics.",
            "The F-10 Australian Curriculum: Mathematics provides students with essential mathematical skills and knowledge in Number and Algebra, Measurement and Geometry, and Statistics and Probability. It develops the numeracy capabilities that all students need in their personal, work and civic life, and provides the fundamentals on which mathematical specialties and professional applications of mathematics are built."
        ]
    },
    {"name":"Australian.Curriculum.Science","size":6714,"imports":[
            "Australian.Curriculum.Health And Physical Education"
        ],"description":[
            "The Australian Curriculum in Science includes:",
            "The Foundation to Year 10 Australian Curriculum: Science",
            "The senior secondary subjects of Biology, Chemistry, Earth and Environmental Science and Physics.",
            "The F-10 Australian Curriculum: Science provides opportunities for students to develop an understanding of important science concepts and processes, the practices used to develop scientific knowledge, of science’s contribution to our culture and society, and its applications in our lives. It provides an understanding of scientific inquiry methods, a foundation of knowledge across the disciplines of science, and develops an ability to communicate scientific understanding and use evidence to solve problems and make evidence-based decisions. The curriculum supports students to develop the scientific knowledge, understandings and skills to make informed decisions about local, national and global issues and to participate, if they so wish, in science-related careers."
        ]
    },
    {"name":"Australian.Curriculum.Health And Physical Education","size":743,"imports":[
            "Australian.Curriculum.Work Studies"
        ],"description":[
            "Health and Physical Education offers experiential learning, with a curriculum that is relevant, engaging, contemporary, physically active, enjoyable and developmentally appropriate. Integral to Health and Physical Education is the acquisition of movement skills, concepts and strategies that enable students to participate in a range of physical activities confidently and competently. In Health and Physical Education, students develop the knowledge, understanding and skills to support them to be resilient, to develop a strong sense of self, to build and maintain satisfying relationships, to make health-enhancing decisions in relation to their health and physical activity participation, and to develop health literacy competencies in order to enhance their own and others’ health and wellbeing."        
        ]
    },
    {"name":"Australian.Curriculum.Work Studies","size":3534,"imports":[
            "Australian.Curriculum.Humanities And Social Science"
        ],"description":[
            "The Australian Curriculum: Work Studies, Years 9–10 has been written in response to key work-related issues facing young people today and into the future. This is a world-leading, future-oriented curriculum, equal in quality, value and rigour to more traditional academic programs."        
        ]
    },
    {"name":"Australian.Curriculum.Humanities And Social Science","size":5731,"imports":[
            "Australian.Curriculum.The Arts"
        ],"description":[
            "The Australian Curriculum: Humanities and Social Sciences includes five subjects. F-6/7 HASS. 7-10 Civics and Citizenship, 7-10 Economics and Business, 7-10 Geography and 7-10 History.",
            "The Civics and Citizenship curriculum is all about ensuring students have the skills and values to become active and informed citizens. Students will investigate political and legal systems, and explore the nature of citizenship, diversity and identity in contemporary society.",
            "The economics and business curriculum explores aspects of economics and business that affect daily life. Students will learn about the role that individuals, businesses and governments play in the economy, the way they make decisions about how to allocate resources and the effects of these decisions.",
            "The Australian Curriculum in geography includes:",
            "the Years 7-10 Australian Curriculum: Geography",
            "the senior secondary Australian Curriculum: Geography",
            "The Years 7-10 Australian Curriculum: Geography provides opportunities for students to investigate, analyse and explain the characteristics of the places that make up our world.",
            "The Australian Curriculum in History includes:",
            "the Years 7-10 Australian Curriculum: History",
            "the senior secondary Australian Curriculum: History",
            "The Years 7-10 Australian Curriculum: History provides opportunities for students to investigate Australian and world history. Australian history is to be taught within a world history context. Students develop knowledge, understanding and skills through their study of societies, events, movements and developments. There are opportunities to study the role of individuals and groups and their significance."
        ]
    },
    {"name":"Australian.Curriculum.The Arts","size":7840,"imports":[
            "Australian.Curriculum.Technologies"
        ],"description":[
            "The Arts have the capacity to engage, inspire and enrich all students, exciting the imagination and encouraging them to reach their creative and expressive potential. The Australian Curriculum: The Arts offers students the opportunity to study all five subjects in the primary years of schooling, and to specialise in secondary school. The five subjects enable students to learn how to create, design, represent, communicate and share their imagined and conceptual ideas, emotions, observations and experiences."        
        ]
    },
    {"name":"Australian.Curriculum.Technologies","size":5914,"imports":[
            "Australian.Curriculum.Languages"
        ],"description":[
            "The Australian Curriculum: Technologies draws together the distinct but related subjects of Design and Technologies, and Digital Technologies. It ensures that all students benefit from learning about, and working with, traditional, contemporary and emerging technologies that shape the world in which we live. In creating solutions, as well as responding to the designed world, students will contribute to sustainable patterns of living for themselves and others."        
        ]
    },
    {"name":"Australian.Curriculum.Languages","size":3416,"imports":[
            "Australian.Curriculum.English"
        ],"description":[
            "The Australian Curriculum: Languages is designed to enable all students in Australia to learn a language in addition to English. The Australian Curriculum: Languages recognises that students bring their own linguistic and cultural background to their learning, whether this is English or the target language or various combinations of languages. The organisation of the curriculum addresses learner background in the target language by providing a number of pathways and entry points of study to cater for background language learners, first language learners and second language learners.",
            "The Australian Curriculum: Languages includes language-specific curricula for world languages and two frameworks. The Languages included are Arabic, Auslan, Chinese, The Framework for Aboriginal Languages and Torres Strait Islander Languages, The Framework for Classical Languages, French, German, Hindi, Indonesian, Italian, Japanese, Korean, Modern Greek, Spanish, Turkish and Vietnamese."        
        ]
    }
]
