{
  "title" : "ICT Maturity Framework",
  "version" : "1.0",
  "types" : [
    {
      "label" : "Learning",
      "descriptions" : [
          "LEARNER",
          "A student that is excellent at using technology can make decisions on the appropriate use of ICT by being able to:",
          "apply understanding of social and ethical protocols and practices when using technology",
          "communicate safely and effectively using ICT",
          "manage ICT software and hardware to solve problems and achieve learning goals",
          "create digital products that solve problems, entertain, inform or persuade",
          "investigate with ICT - locate, access, generate, organise and/or analyse data and information and apply criteria to verify the integrity and value of the digital data, information and sources",
          "transfer and adapt their knowledge and understanding of how ICT works when presented with new technologies."
      ],
      "items" : [
        {
          "label" : "IMF 1",
          "cells" : [
            {
              "label" : "IMF.1.0",
              "title" : "Learning",
              "descriptions" : [ "Personalise to extend student learning" ]
            }, {
              "label" : "IMF.1.1",
              "title" : "Foundation",
              "descriptions" : [ "Teachers direct all interaction with ICTs for students in their classroom." ]
            }, {
              "label" : "IMF.1.2",
              "title" : "Developing",
              "descriptions" : [ "Teachers use data to inform the design of learning experiences for small (sub-class) groups of similar students.", "Student choice is built into some learning.", "Student-to-student collaboration occurs, at times with the aid of ICT.", "Student learning is scaffolded using ICT." ]
            }, {
              "label" : "IMF.1.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Student learning is self-directed using well communicated self-regulation and feedback.", "Students independently access learning experiences in most syllabus areas when they need it.", "Student collaboration is enhanced with technology.", "Students receive equitable learning opportunities from effective use of assistive technology." ]
            }, {
              "label" : "IMF.1.4",
              "title" : "Excelling",
              "descriptions" : [ "Students and teachers co-design learning using ICT for shared access to holistic learning information.", "Students have ubiquitous and equitable access to learning experiences relevant to their needs.", "Students are responsible for appropriate, efficient and effective collaboration and communication." ]
            }
          ]
        }, {
          "label" : "IMF 2",
          "cells" : [
            {
              "label" : "IMF.2.0",
              "title" : "Learning",
              "descriptions" : [ "Connect beyond the classroom" ]
            }, {
              "label" : "IMF.2.1",
              "title" : "Foundation",
              "descriptions" : [ "Student access to technology is isolated from their other learning." ]
            }, {
              "label" : "IMF.2.2",
              "title" : "Developing",
              "descriptions" : [ "Students use technology to support learning in their classroom.", "Students use ICT to demonstrate their learning to their teacher." ]
            }, {
              "label" : "IMF.2.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Students use ICT to support access to learning within and beyond the school.", "Students collaborate to create ICT products to demonstrate learning to an authentic audience." ]
            }, {
              "label" : "IMF.2.4",
              "title" : "Excelling",
              "descriptions" : [ "Students access learning content and expertise not available in school through safe and effective use of ICT.", "Student use ICT to appropriately communicate learning and solutions to a real world audience." ]
            }
          ]
        }, {
          "label" : "IMF 3",
          "cells" : [
            {
              "label" : "IMF.3.0",
              "title" : "Learning",
              "descriptions" : [ "Develop measure and monitor digital literacy" ]
            }, {
              "label" : "IMF.3.1",
              "title" : "Foundation",
              "descriptions" : [ "Students do not receive feedback on safe and ethical use of ICT for learning." ]
            }, {
              "label" : "IMF.3.2",
              "title" : "Developing",
              "descriptions" : [ "Student learning incorporates assessment and explicit teaching of safe and ethical use of ICT." ]
            }, {
              "label" : "IMF.3.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Students reflect on and modify their use of ICT to ensure it is safe and ethical." ]
            }, {
              "label" : "IMF.3.4",
              "title" : "Excelling",
              "descriptions" : [ "Students reflect on, modify and model appropriate safe and ethical use of ICT." ]
            }, {
              "label" : "IMF.3.5",
              "title" : "Foundation",
              "descriptions" : [ "Students learn to manage and operate ICT for investigation, creation and communication in an adhoc manner." ]
            }, {
              "label" : "IMF.3.6",
              "title" : "Developing",
              "descriptions" : [ "Students learn about management and operation of ICT for investigation, creation and communication during the course of their typical lessons." ]
            }, {
              "label" : "IMF.3.7",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Students access instruction about ICT for investigation, creation and communication when they need it to support their learning." ]
            }, {
              "label" : "IMF.3.8",
              "title" : "Excelling",
              "descriptions" : [ "Students create and share digital resources to enhance the skills of others." ]
            }
          ]
        }
      ]
    }, {
      "label" : "Teaching",
      "descriptions" : [
        "TEACHER",
        "An educator evaluates technology use by asking if it:",
        "enables or enhances evidence-based strategies",
        "enables new and better ways of learning",
        "automates administrative tasks to maximise time spent on teaching and learning.",
        "",
        "They also:",
        "directly connect development of a strong and positive culture of digital citizenship to students personal use of ICT including social media",
        "teach, assess and provide meaningful feedback on the ICT knowledge and skills students need",
        "share and model effective use of ICT within and beyond the school",
        "access suitable resources in the form of professional learning, information and people that can help them improve their use of ICT for student learning."
      ],
      "items" : [
        {
          "label": "IMF 4",
          "cells": [
            {
              "label" : "IMF.4.0",
              "title" : "Teaching",
              "descriptions" : [ "Visualise student growth" ]
            }, {
              "label" : "IMF.4.1",
              "title" : "Foundation",
              "descriptions" : [ "Teachers keep isolated records of student learning." ]
            }, {
              "label" : "IMF.4.2",
              "title" : "Developing",
              "descriptions" : [ "Teachers record assessment data from standardised assessments on a school wide system.", "Teachers utilise a combination of observations and assessment data to feedback to students." ]
            }, {
              "label" : "IMF.4.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Teachers record holistic learning information in a central system.", "Teachers give access to holistic learning information to students and parents on request.", "Teachers access useful information about student performance across transition points." ]
            }, {
              "label" : "IMF.4.4",
              "title" : "Excelling",
              "descriptions" : [ "Students and appropriate stakeholders can access information about the whole child in as close to real time as possible.", "Teachers align student performance information across transitions between stages of education." ]
            }
          ]
        }, {
          "label": "IMF 5",
          "cells": [
            {
              "label" : "IMF.5.0",
              "title" : "Teaching",
              "descriptions" : [ "Access and utilise student wellbeing information" ]
            }, {
              "label" : "IMF.5.1",
              "title" : "Foundation",
              "descriptions" : [ "Student wellbeing is tracked by individual teachers.", "Student personal interests are known." ]
            }, {
              "label" : "IMF.5.2",
              "title" : "Developing",
              "descriptions" : [ "Staff record student wellbeing data in a centralised service.", "Student wellbeing data is aligned to the Wellbeing framework." ]
            }, {
              "label" : "IMF.5.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Staff use student wellbeing information from a centrally managed service to adapt school programs.", "Appropriate stakeholders access student wellbeing information at the discretion of the school." ]
            }, {
              "label" : "IMF.5.4",
              "title" : "Excelling",
              "descriptions" : [ "Student wellbeing information is in a single, integrated, interoperable system for ensuring welfare, teaching and learning programs are catering for student needs." ]
            }
          ]
        }, {
          "label": "IMF 6",
          "cells": [
            {
              "label" : "IMF.6.0",
              "title" : "Teaching",
              "descriptions" : [ "Constant evaluation and improvement" ]
            }, {
              "label" : "IMF.6.1",
              "title" : "Foundation",
              "descriptions" : [ "Teachers identify problems but they not solved with a whole school approach." ]
            }, {
              "label" : "IMF.6.2",
              "title" : "Developing",
              "descriptions" : [ "Some teachers regularly collaborate and share digital innovations within the school." ]
            }, {
              "label" : "IMF.6.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Teachers regularly collaborate and share digital innovations within the school and seek solutions from the wider community." ]
            }, {
              "label" : "IMF.6.4",
              "title" : "Excelling",
              "descriptions" : [ "Teachers collaborate beyond the school to support innovation that improves learning and/or administration." ]
            }
          ]
        }, {
          "label": "IMF 7",
          "cells": [
            {
              "label" : "IMF.7.0",
              "title" : "Teaching",
              "descriptions" : [ "Effective planning and programming" ]
            }, {
              "label" : "IMF.7.1",
              "title" : "Foundation",
              "descriptions" : [ "Teachers? programs are created in isolation.", "Teachers? programs are not responsive to student needs." ]
            }, {
              "label" : "IMF.7.2",
              "title" : "Developing",
              "descriptions" : [ "Teachers share programming by dividing up the tasks and combining the work later.", "Teachers? programs differentiates between groups student needs." ]
            }, {
              "label" : "IMF.7.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Teachers co-design learning programs with colleagues.", "Teachers create and modify programs based on personalised student learning needs." ]
            }, {
              "label" : "IMF.7.4",
              "title" : "Excelling",
              "descriptions" : [ "Teachers co-design learning programs with students and a range of stakeholders.", "Teaching and learning programs respond to individual student needs and are available to all stakeholders." ]
            }
          ]
        }, {
          "label": "IMF 8",
          "cells": [
            {
              "label" : "IMF.8.0",
              "title" : "Teaching",
              "descriptions" : [ "Efficient and effective feedback and reporting." ]
            }, {
              "label" : "IMF.8.1",
              "title" : "Foundation",
              "descriptions" : [ "Teachers must be present for feedback to be delivered." ]
            }, {
              "label" : "IMF.8.2",
              "title" : "Developing",
              "descriptions" : [ "Teachers use digital tools to deliver immediate, asynchronous and/or automated feedback." ]
            }, {
              "label" : "IMF.8.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Teachers use published assessment measures to provide growth oriented feedback to students using a variety of digital and analogue processes." ]
            }, {
              "label" : "IMF.8.4",
              "title" : "Excelling",
              "descriptions" : [ "Teachers and students co-create assessment measures to develop a culture focussed on growth." ]
            }, {
              "label" : "IMF.8.5",
              "title" : "Foundation",
              "descriptions" : [ "Teachers manually generate reports to parents." ]
            }, {
              "label" : "IMF.8.6",
              "title" : "Developing",
              "descriptions" : [ "Teachers use a centralised system to create student reports." ]
            }, {
              "label" : "IMF.8.7",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Teachers create reports using appropriate digital automation." ]
            }, {
              "label" : "IMF.8.8",
              "title" : "Excelling",
              "descriptions" : [ "Appropriate stakeholders access student learning information in real time." ]
            }
          ]
        }, {
          "label": "IMF 9",
          "cells": [
            {
              "label" : "IMF.9.0",
              "title" : "Teaching",
              "descriptions" : [ "Staff digital literacy" ]
            }, {
              "label" : "IMF.9.1",
              "title" : "Foundation",
              "descriptions" : [ "Staff do not model safe and ethical use of ICT to students.", "Staff do not learn to use ICT for teaching and learning.", "Some staff are able to troubleshoot simple solutions to common ICT issues in their own learning environments." ]
            }, {
              "label" : "IMF.9.2",
              "title" : "Developing",
              "descriptions" : [ "Staff model safe and ethical use of ICT to students.", "Staff use ICT to enhance some aspects of their teaching and learning.", "Staff are able to troubleshoot simple solutions to common ICT issues in their own learning environments." ]
            }, {
              "label" : "IMF.9.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Staff model and teach safe and ethical use of technology as part of their learning programs.", "Staff use ICT to personalise learning and to connect students to learning they cannot otherwise access.", "Staff confidently troubleshoot solutions to ICT issues in their learning environments." ]
            }, {
              "label" : "IMF.9.4",
              "title" : "Excelling",
              "descriptions" : [ "Staff apply a high level of digital literacy to ensure quality learning.", "Staff apply a high level of digital literacy to ensure technology can support quality learning in their learning environments." ]
            }
          ]
        }
      ]
    }, {
      "label" : "Leading",
      "descriptions" : [
        "LEADER",
        "",
        "Principals embed a culture of continuous improvement, ensuring research, innovation and creativity are core characteristics of the school. (Australian Institute for Teaching and School Leadership, 2014).",
        "",
        "All leaders support their strategic vision for quality learning by:",
        "assessing the ICT maturity of the school and develop a plan of action to improve use for quality learning and administration",
        "supporting leaders in other schools using a shared terminology / core logic",
        "modelling effective use of ICT",
        "leading digital innovation for improvement of student outcomes and efficient administration",
        " provide effective feedback to staff innovations",
        " allocate responsibility and promote a transparent learning community",
        " source and make available resources in the form of professional learning, information and people to help them achieve their strategic vison and the action plan",
        "",
        "In addition technical leaders, in response to the schools strategic vision:",
        "manage school ICT hardware, software and IT services",
        "adopt or create digital innovation for an educational purpose"
      ],
      "items" : [
        {
          "label": "IMF 10",
          "cells": [
            {
              "label" : "IMF.10.0",
              "title" : "Leading",
              "descriptions" : [ "Enabling distributed leadership" ]
            }, {
              "label" : "IMF.10.1",
              "title" : "Foundation",
              "descriptions" : [ "Leaders are developing a vision on the use of technology that aligns with the school?s vision of quality learning." ]
            }, {
              "label" : "IMF.10.2",
              "title" : "Developing",
              "descriptions" : [ "Leaders actively share a vision of quality learning that incorporates the use of technology." ]
            }, {
              "label" : "IMF.10.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "The whole school community is aware of the quality learning vision.", "Staff committees are responsible for purposeful innovation." ]
            }, {
              "label" : "IMF.10.4",
              "title" : "Excelling",
              "descriptions" : [ "School leadership articulates a quality learning vision for the school that empowers purposeful digital innovation across the school." ]
            }
          ]
        }, {
          "label": "IMF 11",
          "cells": [
            {
              "label" : "IMF.11.0",
              "title" : "Leading",
              "descriptions" : [ "Supporting professional learning (PL)" ]
            }, {
              "label" : "IMF.11.1",
              "title" : "Foundation",
              "descriptions" : [ "Leaders do not reference technology in the school PL plan.", "Some teachers include technology in their PDP." ]
            }, {
              "label" : "IMF.11.2",
              "title" : "Developing",
              "descriptions" : [ "Leaders reference technology as an option in the school PL plan.", "Most staff include technology in their PDP." ]
            }, {
              "label" : "IMF.11.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Leaders integrate existing technology into the school PL plan.", "Staff include technology in their PDP to address school improvement targets." ]
            }, {
              "label" : "IMF.11.4",
              "title" : "Excelling",
              "descriptions" : [ "Leaders integrate existing and emerging technology into the school PL plan.", "Staff pro-actively innovate with technology to support school improvement targets." ]
            }
          ]
        }, {
          "label": "IMF 12",
          "cells": [
            {
              "label" : "IMF.12.0",
              "title" : "Leading",
              "descriptions" : [ "Managing learning resources digitally" ]
            }, {
              "label" : "IMF.12.1",
              "title" : "Foundation",
              "descriptions" : [ "Leaders do not support access to digital resource repositories for the school.", "Teachers find or create digital learning resources for students in their classes to use.", "Leaders regularly review processes to ensure they align with department policy." ]
            }, {
              "label" : "IMF.12.2",
              "title" : "Developing",
              "descriptions" : [ "Leaders provide access to digital resource repositories.", "Teachers share digital resources that they find or create within the school." ]
            }, {
              "label" : "IMF.12.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Leaders align access to digital resource repositories to the schools quality learning vision.", "School created digital resources are managed using a shared curation system and data retention policy." ]
            }, {
              "label" : "IMF.12.4",
              "title" : "Excelling",
              "descriptions" : [ "The school integrates external digital resource repositories with school created digital learning resources.", "Staff routinely share digital resources and how they use them beyond the school." ]
            }
          ]
        }, {
          "label": "IMF 13",
          "cells": [
            {
              "label" : "IMF.13.0",
              "title" : "Leading",
              "descriptions" : [ "Automating processes" ]
            }, {
              "label" : "IMF.13.1",
              "title" : "Foundation",
              "descriptions" : [ "Leaders do not explore opportunities to automate processes." ]
            }, {
              "label" : "IMF.13.2",
              "title" : "Developing",
              "descriptions" : [ "Leaders are working to automate simple processes." ]
            }, {
              "label" : "IMF.13.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Leaders and staff actively seek opportunities to automate processes with human involvement aligned to department policy." ]
            }, {
              "label" : "IMF.13.4",
              "title" : "Excelling",
              "descriptions" : [ "School staff employ automated processes that increase the instructional focus of teachers." ]
            }
          ]
        }, {
          "label": "IMF 14",
          "cells": [
            {
              "label" : "IMF.14.0",
              "title" : "Leading",
              "descriptions" : [ "School systems and infrastructure" ]
            }, {
              "label" : "IMF.14.1",
              "title" : "Foundation",
              "descriptions" : [ "Staff and students do not generally use ICTs for learning and teaching.", "Staff express low confidence in the ICT infrastructure in the school." ]
            }, {
              "label" : "IMF.14.2",
              "title" : "Developing",
              "descriptions" : [ "Staff and students access ICTs with a booking system.", "Staff accept that ICT infrastructure will deliver the expected service." ]
            }, {
              "label" : "IMF.14.3",
              "title" : "Sustaining and Graowing",
              "descriptions" : [ "Staff and students use ICTs in any learning environment to support learning.", "Staff no longer discuss ICT infrastructure because it just works." ]
            }, {
              "label" : "IMF.14.4",
              "title" : "Excelling",
              "descriptions" : [ "Leaders align ICT procurement to meet the school vison of quality learning.", "Leaders have a strategic view of ICT infrastructure that takes into accunt predicted future innovation." ]
            }
          ]
        }
      ]
    }
  ]
}