{
  "title" : "SEF SDS Considerations",
  "version" : "1.0",
  "domains" : [ {
    "title" : "Learning Domain",
    "links" : [ "C.1", "C.2", "C.3" ],
    "topics" : [ {
      "title" : "Learning Culture",
      "cells" : [{
        "label" : "High Expectations",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.4", "C.1.2.1", "C.1.3.1", "C.1.4.1", "C.3.1.1", "C.3.3.2", "C.3.3.3", "IMF.10.0", "IMF.11.0"],
        "dleAspects" : {
          "descriptions" : ["Aligned School Plan and Strategic Milestone documents available and tracked online.", "Online transparent delivery of high level teaching and learning activities and monitoring of learning progress and achievement for all staff and students.", "Analysis of learning progression, student wellbeing and parent/community expectations. (example TTFM)", "IEPs, PLPs and adjustment plan; creation, completion and review online, with the ability for parents to continually communicate/collaborate with teachers/stakeholders involved.", "Digital Maturity assessment completed through school planning process. Including best practice guides and blueprints for success." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Consistency of quality practice and approach across Schools in local area including administrative, pedagogical and teaching and learning systems.", "Equity of high level Digital Learning Environment that enables effective partnerships.", "Communication between school and parents as partners to support the whole child." ],
          "links" : [ "APST.1.5.2", "APST.5.5.2" ]
        },
        "delivering" : {
          "descriptions" : ["Progress in learning and achievement is identified and acknowledged. The aspirations and expectations of students and parents are known and inform planning for learning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "There is demonstrated commitment within the school community that all students make learning progress.", "Partnerships with parents and students support clear improvement aims and planning for learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The whole school community demonstrates aspirational expectations of learning progress and achievement for all students, and is committed to the pursuit of excellence.", "Effective partnerships in learning with parents and students mean students are motivated to deliver their best and continually improve." ],
          "links" : [ ]
        }
      }, {
        "label" : "Transitions and Continuity of Learning",
        "links" : [ "C.1.1.4", "C.1.2.1", "C.1.3.2", "C.1.4.1", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.2.0", "IMF.5.0" ],
        "dleAspects" : {
          "descriptions" : [ "Unified Digital Learning Environment and approaches across all schools in educational pathways K-12.", "General Capabilities, Literacy and Numeracy Progressions (Plan 2 data) to migrate with students K-12.", "Access to Stage 3 learning progression and wellbeing data by Stage 4 teachers and Stage 5 data by Stage 6 teachers to support transition.", "SIS, LMS, PD and administration consistent across all schools in a directorate or region.", "All student data stored and accessible in a single place (i.e. Power BI or similar).", "Transparent communication with parents and the community, including social media and SWS.", "E-Portfolio and learning profiles for students K-12 to enable lifelong learning records of achievement.", "Distance Education options considered, and Student mobility catered for.", "Data Lake: consistency of educational pathway administration and learning tools.", "Social Media usage by teachers and school" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Students and parents / caregivers have a complete picture of the learning along progressions (transition points). Mobility of students is not problematic due to online access across all schools K-12. Identification and early intervention of student learning needs are discoverable at the point of need."],
          "links" : [ "APST.5.4.2", "APST.5.1.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school actively plans for student transitions (e.g. into Kindergarten; Y6 to Y7; Y10 to Y11). The school clearly communicates its transition activities to the school community." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school collects and analyses information to inform and support students’ successful transitions.", "The school seeks to collaborate with parents of students whose continuity of learning is at risk." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school engages in strong collaborations between parents, students and the community that inform and support continuity of learning for all students at transition points, including highly mobile students and students with atypical enrolment." ],
          "links" : [ ]
        }
      }, {
        "label" : "Attendance",
        "links" : [ "C.1.4.1", "C.2.1.2", "C.2.4.2", "C.3.3.2", "C.3.3.3", "C.3.6.1", "IMF.2.0", "IMF.5.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Student whereabouts accounted for at all times (Sentral incursion)", "Automatic notification sent to parents/carers if student is away.", "Ability to explain absences online or via text/app.", "Ability to easily identify work/assessments missed due to absence, and support for student in the completion of all learning outcomes and progressions.", "Automatic identification of students with attendance concerns and support through online access to learning material.", "Ability to remotely access classroom teaching and learning including direct instruction via VC, recording or streaming, to enable students who are unable to physically attend class.", "Distance Education:", "Data Lake:  HSLO, attendance data from administration tools / EBS" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Students attend class to learn, socialise, communicate, learn to critically think and develop cognitive skills for growth.", "24/7 access to learning online for students who are ill, away or absent for any reason ensures a continuation of learning and minimises negative impacts on learning outcomes." ],
          "links" : [ "APST.7.3.3", "APST.4.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Staff regularly and accurately monitor attendance and take prompt action to address issues with individual students.", "The school community celebrates regular and improved attendance." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Attendance data is regularly analysed and is used to inform planning. Whole of school and personalised attendance approaches are improving regular attendance rates for all students, including those at risk." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teachers, parents and the community work together to support consistent and systematic processes that ensure student absences do not impact on learning outcomes." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Wellbeing",
      "cells" : [{
        "label" : "Caring for students",
        "links" : [ "C.1.2.1", "C.1.3.1", "C.1.3.2", "C.2.1.2", "C.2.4.1", "C.2.4.2", "C.2.4.6", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.5.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online tracking of wellbeing including positive/negative incidents and awards.", "Automatic notification of wellbeing issue/incident workflows to ensure teachers are supported in the timely resolution of wellbeing incidents.", "Student flags for ease of identification of important information related to individual student needs.", "IEPs, PLPs, health plans, accommodations for learning in a single place accessible for all stakeholders.", "Online communication between Parent/Students/Teachers.", "Distance Education:" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Students and staff have access to accurate and quality information online in regards to student identified needs or new information as it arises through “line of sight” management. This information can also be tracked and documented to decrease duplication of work and achieve sustainable results in a more realistic timeframe. Staff transition issues are also decreased due to ‘cases’ being online and information accessible to identify continued support, regardless of the staff member.", "Continuity of quality service (when considering these standards as a system, not classrooms)" ],
          "links" : [ "APST.4.2.2", "APST.4.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The wellbeing of students is explicitly supported by identified staff." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Every student can identify a staff member to whom they can confidently turn for advice and assistance at school." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school is organised so that all students have regular opportunities to meet with an identified staff member who can provide advice, support and assistance to help students fulfil their potential." ],
          "links" : [ ]
        }
      }, {
        "label" : "A planned approach to wellbeing",
        "links" : [ "C.1.2.1", "C.1.3.1", "C.1.3.2", "C.1.4.1", "C.1.4.2", "C.2.3.3", "C.2.4.2", "C.2.4.6", "C.3.3.2", "C.3.3.3", "IMF.3.0", "IMF.5.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Access to external teaching and learning resources identified to support specific wellbeing indicatives within schools e.g. RUOK day, Harmony day, ANZAC day, Australia day, Sorry day, Crack A Smile day, etc.", "Utilisation of whole school and state-wide cross-curricular wellbeing resources linked to specific programs to be accessed online and at point of need e.g. E-safety, All My Own Work.", "TTFM (or equivalent): Student, Staff and Parent surveys completed and analysed to identify whole school wellbeing priorities.", "Wellbeing referral systems / positive referral systems, suspension data, attendance data systems, PBL systems" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Schools have the ability to target support based on clear and concise data, looking at analysis for their own instance. Student voice, feedback and discussions with staff. Can also be monitored/gathered online to facilitate continuous improvement around all wellbeing practices."],
          "links" : [ "APST.4.1.2", "APST.6.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Students, staff and the community recognise that student wellbeing and engagement are important conditions for learning.\nThe school plans for and monitors a whole school approach to student wellbeing and engagement."],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school collects, analyses and uses data including valid and reliable student, parent and staff surveys/feedback to monitor and refine a whole school approach to wellbeing and engagement, to improve learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school has implemented evidence-based change to whole school practices, resulting in measurable improvements in wellbeing and engagement to support learning." ],
          "links" : [ ]
        }
      }, {
        "label" : "Individual learning needs",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.3.3", "C.1.4.1", "C.1.4.2", "C.2.1.2", "C.2.4.2", "C.2.4.6", "C.3.3.2", "C.3.3.3", " IMF2.0", "IMF.5.0", "IMF.7.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : ["IEPs, PLPs and accommodation for learning placed online.", "Tracking of student learning progression and achievement online and available in a single dashboard for teachers.", "Teacher ‘insights’ data dashboard that easily displays all relevant information pertaining to students’ learning needs, level of learning attainment, attendance and wellbeing data.", "Health and wellbeing information/profile available online; including the ability of parents to view and confirm or request an update of health records.", "Distance Education: WAP" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Current data available on all students assists staff to tailor lessons, outcomes, learning challenges and differentiate for the individual and or group. Teachers are catering for social, linguistic and cultural backgrounds as well as a full range of abilities. Student situations can also change constantly and staff need notifications of these as they happen e.g. medical emergencies, mental health diagnosis etc." ],
          "links" : [ "APST.1.3.2", "APST.1.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The needs of all students are explicitly addressed in teaching and learning programs." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Well-developed and evidence-based approaches, programs and assessment processes identify, regularly monitor and review individual student learning needs." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "There is school-wide, collective responsibility for student learning and success, which is shared by parents and students. Planning for learning is informed by sound holistic information about each student’s wellbeing and learning needs in consultation with parents/carers." ],
          "links" : [ ]
        }
      }, {
        "label" : "Behaviour",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.4.1", "C.2.1.2", "C.2.4.2", "C.2.4.6", "C.3.3.2", "C.3.3.3", "IMF.4.0", "IMF.5.0", "IMF.7.0" ],
        "dleAspects" : {
          "descriptions" : [ "School wellbeing incidents handled online and with a consistent system, procedure and approach.", "Guidelines for behaviour are clearly accessible on school systems and are explicitly stated.", "Use of effective future focused pedagogy used to engage students and reduce wellbeing referrals.", "Push notification of positive wellbeing incidents, awards and participations to parent portal to promote positive behaviour for learning." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Accurate records for behaviour management and learning records kept online for defining patterns of behaviour, areas of need, support for students and staff. (APST- 4.2.2, 4.3.2, 4.4.2)", "Schools can also promote professional development online through management systems to keep staff up to date with classroom management techniques, engaging pedagogical practice." ],
          "links" : [ "APST.6.2.2", "APST.6.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school’s wellbeing approach focuses on creating an effective environment for learning.", "Teachers and other school staff explicitly communicate expectations of behaviour across school settings." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Expectations of behaviour are co-developed with students, staff and the community and are designed to ensure effective conditions for learning. They are explicitly, consistently and supportively applied across the school." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Positive, respectful relationships are evident and widespread among students and staff and promote student wellbeing to ensure optimum conditions for student learning across the whole school." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Curriculum",
      "cells" : [{
        "label" : "Curriculum provision",
        "links" : [ "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.1.4.2", "C.3.3.2", "C.3.3.3", "IMF.3.0", "IMF.4.0", "IMF.7.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Automatic/systematic online digital registration of assessment, tasks/notifications, teaching and learning programs and lessons plans (Digital Daybook).", "Links to curriculum documentation available to staff through intranet, Yammer and other online collaborative communities.", "Online tracking of metadata linked to syllabus outcomes for continuous assessment of student learning progression.", "Access to digital resource repositories (DoE Digital Learning Resources Hub)" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Cross-referencing of monitoring systems means administrative time saving e.g. if a digital daybook holds lesson plans, on completion of these lessons should be an automatic registration of work. When the lesson plans involve assessment tasks, dates and task notifications are also registered and time stamped. This in turn provides evidence for student needs, requirements and data to support recommendations in regards to individual learning options over the K-12 continuum." ],
          "links" : [ "APST.2.5.2", "APST.3.6.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school offers a curriculum that meets requirements of the Department of Education and the NSW Education Standards Authority and provides equitable academic opportunities for all students." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school’s curriculum provision and evidence-based teaching practices provide a high expectations framework, within which all students effectively develop their knowledge, understanding and skills.", "The school monitors and reviews its curriculum provision to meet changing requirements of the students." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school’s curriculum provision supports high expectations for student learning. The curriculum is enhanced by learning alliances with other schools or organisations, where useful and practicable.", "Students’ learning and courses of study are monitored longitudinally (for example K-2; K-6; 7-12) to ensure continued challenge and maximum learning." ],
          "links" : [ ]
        }
      }, {
        "label" : "Teaching and learning programs",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.1.4.2", "C.2.1.2", "C.2.2.3", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.4.0", "IMF.7.0", "IMF.8.0", "IMF.12.0" ],
        "dleAspects" : {
          "descriptions" : [ "Use of NESA Program Builder and aligned resources in the creation of teaching and learning programs.", "Ability to align a Digital Daybook to online registration documentation.", "(DoE Digital Learning Resources Hub) Link to available quality teaching and learning programs, resources, assessments and rubrics.", "HSC monitoring completed online and aligned to specific learning challenges, lessons or resources." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Programs are accessible to staff 24/7 as working documents constantly referred to and refined. They should also link to a digital daybook highlighting the registration and scope and sequences. The programs highlight student progressions and tracking the outcomes met, adapting to the data presented from student assessment. Online monitoring is essential for cross-referencing all compliance teaching and learning documents – hyperlinked with policies, procedures, research, evidence and resources to support the program.", "Having working programs shared in a common space would also assist in workload management, transparency of content and equity for student access (if they were working through distance programs etc.)" ],
          "links" : [ "APST.3.1.4", "APST.3.2.2", "APST.3.3.2", "APST.3.4.2", "APST.3.6.2", "APST.5.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teaching and learning programs describe what all students are expected to know, understand and do." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teaching and learning programs describe expected student progression in knowledge, understanding and skill and the assessments that measure them." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teaching and learning programs are dynamic, showing evidence of revisions based on feedback on teaching practices, consistent and reliable student assessment and continuous tracking of student progress and achievement." ],
          "links" : [ ]
        }
      }, {
        "label" : "Differentiation",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.3.3", "C.1.4.1", "C.1.4.2", "C.2.1.1", "C.2.2.1", "C.2.2.2", "C.2.4.2", "C.2.4.6", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.4.0", "IMF.7.0", "IMF.12.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Ability to quickly differentiate teaching and learning activities through the creation of tiered rubrics aligned to syllabus outcomes.", "DoE Commons for crowd sourcing of curriculum material directly related to students’ individual interests and abilities.", "Accommodation for learning placed online in student profile with adjustment plans; including faculty specific adjustment from individual teachers.", "Adaptive assessment tasks designed to enable students to engage with content appropriate to their level of learning progression (example: NAPLAN Online)." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Well-programmed learning sequences differentiation will happen organically, students can self-adjust to learning challenges (extension or remedial work – understanding of what they need for themselves) and staff can access digital and non-digital tools for multiple entry points in learning. Parents can also access learning outside hours, support their children and advise teachers based on the content of the lessons. Evidence is also available through the programs to demonstrate the adjustments to learning according to compliance and policy procedures." ],
          "links" : [ "APST.3.7.2", "APST.1.4.2", "APST.1.5.2", "APST.1.6.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Differentiation of curriculum delivery within classrooms happens for some students with particular identified needs. The parents of affected students are advised about adjustments made." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers differentiate curriculum delivery to meet the needs of students at different levels of achievement, including adjustments to support learning or increase challenge. Most students can articulate their learning and understand what they need to learn next to enable continuous improvement." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teaching and learning programs across the school show evidence that they are adjusted to address individual student needs, ensuring that all students are challenged and all adjustments lead to improved learning. Teachers involve students and parents in planning to support learning, and share expected outcomes." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Assessment",
      "cells" : [{
        "label" : "Formative Assessment",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.2.2.2", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.4.0", "IMF.7.0", "IMF.8.0", "IMF.12.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Continuous tracking of student learning attainment and progression online for formal and informal assessments.", "Curriculum linked automatically marked and graded assessments available to students 24/7.", "Micro-credentialing (Badging) of informal tasks/skills to enable tracking and acknowledgment of non-academic or non-curriculum specific achievement" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Feedback is given at the end of every assessment task to students, which is observed by parents. Student data is obtained and further modifications or extension can be made from this e.g. a student doing four assessment tasks per year (5 core subjects) receives 20 pieces of feedback in time. Plus two elective classes doing the same amount of assessment tasks means another eight pieces of feedback. Current reporting systems are now reporting on data that is 4-6 weeks old. Benefits of timely feedback give up to date information for parents and teachers on student outcomes and achievement, allowing students to adjust their focus/efforts mid-term.", "Students can also self-register for learning courses to achieve more targeted learning on topics of their choosing using providers such as LinkedIn Learning." ],
          "links" : [ "APST.2.3.2", "APST.5.1.2", "APST.5.2.2", "APST.5.3.2", "APST.5.4.2", "APST.5.5.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers collect and use assessment data that monitors achievements and identifies gaps in learning to inform planning for particular student groups and individual students." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers routinely use evidence of learning, including a range of formative assessments to inform their teaching, adapt their practice and meet learning needs of students." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Assessment is used flexibly and responsively as an integral part of daily classroom instruction. Formative assessment is practised expertly by teachers." ],
          "links" : [ ]
        }
      }, {
        "label" : "Summative Assessment",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.3", "C.2.2.2", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.4.0", "IMF.7.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "NAPLAN, Best Start, Minimum Standards Testing, VALID, PISA testing, and whole school HSC data and result available to staff online in a single dashboard.", "Individualised suggested practice questions related to specific areas of need for NAPLAN, Minimum Standards and HSC." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Although external tests are not run through current Digital Learning Environment, information can be pushed to students quickly and easily through this platform. Administration in regards to organisation, rooming, timetables for testing windows etc. can be quickly pushed to students and parents.", "Students and parents can look at suggested learning activities to enhance possible success at these tests.", "Staff can utilise student assessment data analytics and make comparative judgments based on external test scores and internal assessment tasks." ],
          "links" : [ "APST.5.4.2", "APST.5.5.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Assessment is planned and undertaken regularly in all classes and data is systematically collected." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Assessment is a tool that supports learning across the school. Teachers use reliable assessments to capture information about student learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school analyses student progress and achievement data and a range of other contextual information. Teachers respond to trends in student achievement, at individual, group and whole school levels." ],
          "links" : [ ]
        }
      }, {
        "label" : "Student Engagement",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.3.3", "C.1.4.1", "C.2.1.2", "C.2.3.3", "C.2.4.2", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.2.0", "IMF.4.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "All assessment and teaching and learning resources available online 24/7.", "Consistent notification, layout, curriculum linking and language used in assessment and aligned rubrics.", "Rubrics/marking criteria available online before tasks are assigned.", "Rubric/marking criteria individually linked to learning progressions and syllabus outcomes.", "Online marking and feedback provided in multiple formats including, video, audio, speech to text, and digital ink annotations.", "Sample answers and student work samples available for students and parents to ensure clear expectations.", "Push notifications and calendar reminders sent to apps and mobile devices and SMS (if configured).", "Automatic reminders of missing and overdue work sent to students and parents.", "Automatic general feedback and antiplagiarism capability to enable multiple draft submission of work and reduce marking times.", "Custom insight dashboards showing detailed usage and engagement metrics to staff at point of need." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Communication between all stakeholders is important to have the students engaged in the continuum of their learning. The benefits of a robust Digital Learning Environment is the notifications to which all parties are identified to any assessment tasks, learning challenges, calendar changes and feedback. Students have full access to all marking criteria and rubrics prior to starting tasks – knowing and understanding the expectations prior to beginning units of work is supporting student’s ability to achieve. Having access to all the meta-language of the unit, task or outcome also supports students and parents in assessment approaches and engagement. From this, students are also more likely to submit assessment tasks having the expectations clearly communicated to them."],
          "links" : [ "APST.3.6.2", "APST.5.5.2", "APST.7.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Students know when and why assessment is undertaken." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers share criteria for student assessment with students. Formative and summative assessments create opportunities for students to receive feedback on their learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Students and parents understand the assessment approaches used in the school and their benefits for learning.", "Feedback from students on their learning derived from assessments informs further teaching." ],
          "links" : [ ]
        }
      }, {
        "label" : "Whole school monitoring of student learning",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.3", "C.2.4.1", "C.2.4.2", "C.3.1.1", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.3.0", "IMF.4.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : [ "Summative assessment data analysis used to identify student learning deficits or opportunity for extension to provide user-friendly reports to teachers and Executive.", "Accommodations for learning plans and documentation used to differentiated assessment task and individualise learning opportunities.", "Differentiated online learning paths that cater for all learners, which are adaptable to individual student needs and interests e.g. Mastery Paths.", "Micro-credentialing (Badges) to enable teachers to monitor student progress through set tasks including formal and informal assessment. Includes the ability of staff and students to record non-syllabus based achievements in an effective way, across platforms. This includes Professional Learning creds such as e-Emergency care, Child protection for staff; White Card training for students; as well as LinkedIn Learning courses for staff and students.  Additionally, it enables the capture of progress against the syllabus, national learning progressions, 21st century skills, life skills, interests, etc." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Students, parents and teachers can visually see representations of data analysis integrated with personalised work samples. Online portfolios demonstrating a body of work showcase the individual learning pathway the student has taken leading to improvement and growth. Comparisons can be made from across years, gender, background and on individual growth.", "Post school options are now including portfolio entry into university and employment opportunities may include an illustration of practise." ],
          "links" : [ "APST.3.1.4", "APST.3.7.2", "APST.5.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "There is a whole school assessment strategy in place that is designed to ensure that the learning of all students is systematically monitored." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school analyses summative assessment data to identify learning progress of individual students and student cohorts. Teachers use summative data to identify student learning and validate formative assessment practices." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school uses systematic and reliable assessment information to evaluate student learning over time and implements changes in teaching that lead to measurable improvement.", "The school has processes in place to support teachers’ consistent, evidence-based judgement and moderation of assessments." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Reporting",
      "cells" : [{
        "label" : "Whole School Reporting",
        "links" : [ "C.1.1.1", "C.1.2.2", "C.1.3.3", "C.1.4.1", "C.2.4.1", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.3.0", "IMF.4.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Integrated online management of marks, activities, attendance, learning progressions, wellbeing and summative assessment in a single repository.", "Syllabus linked to mark books and reporting system, including comment banks, rubrics, continuum data and summative assessment data.", "Non-academic interest related data collated and reported on including extra-curricular activities, participation and engagement data.", "Automation of data entry and review process from SIS to NESA (eBOS) Schools Online." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "This becomes the centralised system linking all teaching and learning to all other data relating to the student’s performance and growth. This could also link into any wellbeing program / student management system to gain a full insight into student information. The benefit is the automatic supply of consistent and reliable data that is live, up to date and can be collected at any point of time. This can include at the beginning, middle and/or end of the school planning cycle." ],
          "links" : [ "APST.7.2.2", "APST.5.5.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school analyses internal and external assessment data to monitor and report on student and school performance." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school has explicit processes to collect, analyse and report specific internal and external student and school performance data, on a regular basis." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school uses a centralised system for analysing and reporting data on student and school performance, including academic growth, non-academic and cross-curriculum data. The school uses data to inform collective decisions about student learning, aligned with improvement measures in the school plan." ],
          "links" : [ ]
        }
      }, {
        "label" : "Student Reports",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.1.4.1", "C.2.1.2", "C.2.1.4", "C.2.2.3", "C.2.4.1", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.4.0", "IMF.5.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : [ "Consistent KLA based templating of online reporting procedures linked to NESA and DoE performance and descriptors.", "Collation of non-academic, cross-curricular, extra-curricular, progression and general capability (GC Continuum) /skill based learning data to enable a holistic individualised report of student achievement/interests.", "Ability to create, monitor and resolve N-Award determinations online and in a timely manner.", "Ability for parents to monitor achievement and wellbeing through continuous assessment and communication in real-time e.g. a parent app/portal." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Student reporting with Digital Learning Environments can be traced from the learning intentions of class lessons to the final product of the feedback / report produced to determine outcomes achieved. Student index cards on engagement in learning, outcome mastery and activity compared to the rest of the class. Clear diagnostics can also be found on students requiring further attention.", "Evidence can also be collated if the student is requiring the possible resolution of N-Award determinations." ],
          "links" : [ "APST. 5.5.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Individual student reports meet Department of Education requirements and include personalised descriptions of the student’s strengths and growth." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Student reports contain personalised information about individual student learning progress and achievement, and preview plans for meeting future learning goals." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Student reports are personalised and comprehensive, providing detailed, clear and specific information about student learning, growth, next steps and improvement measures, as well as relevant contextual and/or comparative data." ],
          "links" : [ ]
        }
      }, {
        "label" : "Parent engagement",
        "links" : [ "C.1.1.4", "C.1.3.3", "C.1.4.1", "C.2.1.2", "C.3.3.2", "C.3.3.3", "C.3.7.4", "IMF.6.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Parent Portal for communication, fee paying/monitoring, attendance, permission slips, reports, enabling parents to access formative and summative assessment as well as teaching and learning resources.", "PDF or digital document report issuing in place of paper reports.", "App/Portal enabling parents to communicate, with teachers including; parent teacher interview booking, PLP/IEP consultation.", "TTFM Parent survey to ensure parental voice is heard and identified priorities are addressed in timely manner.", "Ability to push general notification and school information to school-based social media e.g. Facebook, Twitter, Instagram, etc." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Daily notifications can be accessed by parents at point of need on a range of items from attendance to learning and task feedback. Parents can have two-way conversations online at any time through the communication tools provided whilst observing their child/children.", "Student voice is also accessed through forums from whole school sections within the Digital Learning Environment.", "Links to online school social media is also assisting parents with school opportunities and information for learning." ],
          "links" : [ "APST.5.5.4", "APST.7.4.3" ]
        },
        "delivering" : {
          "descriptions" : [ "Schools provide parents/carers with information on the learning progress of their children, including reports and parent/teacher interviews as well as opportunities to discuss this progress." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Parents are presented with clear information on what and how well their children are learning and receive regular information in accessible formats about how to support their children’s progress. The school solicits feedback on its reporting from parents." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teachers directly and regularly engage with parents to improve understanding of student learning and strengthen student outcomes. Reporting to parents has been enhanced in response to feedback received." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Student Performance Measures",
      "cells" : [{
        "label" : "Value-Add",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.3", "C.2.4.1", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.4.0", "IMF.6.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : [ "Provides individualised learning pathways ensuring students can achieve to the best of their abilities.", "IEP, PLP and accommodation for learning profiles monitored K-12 and available to relevant stakeholders online. Including management of educational goals and learning targets.", "E-portfolios and learning profiles K-12 consistent across schools in local/regional areas to ensure consistency of teacher practice, judgment and tracking of learning progression." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Tracking and monitoring of student achievement and growth is easily determined within the analytics of the Digital Learning Environment. Trends can be determined through subjects, years and individualised to the student. This can also be determined from the start of an IEP right through to the learning portfolio at the end of a learning cycle. Report grades from classes, subjects and years can also be tracked and monitored for trends in value adding." ],
          "links" : [ "APST.5.5.4", "APST.6.3.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school’s value-add is not significantly lower than the value added by the average school." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school’s value-add* trend is positive." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school achieves excellent value-added* results, significantly above the value added by the average school." ],
          "links" : [ ]
        }
      }, {
        "label" : "NAPLAN",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.1.4.1", "C.3.3.2", "C.3.3.3", "IMF.4.0", "IMF.8.0", "IMF.12.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Ability to identify and accommodate for students who require additional assistance in programs such as Bump It Up and ILLNP (similar programs to the old ILNNP).", "Online adaptive assessment/practice material available to cater for the individual needs of students.", "DoE Common repository (DLRH) of curriculum aligned and targeted reading writing and numeracy activities target to KLA’s.", "Automatic identification of resources specifically targeted to students within a class and the ability for students to extend their learning beyond their classroom." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Point in time data on students and ability to identify needs to accommodate students with NAPLAN adjustments with NESA.", "Students can also access “NAPLAN like” resources and complete tasks online, not too dissimilar to NAPLAN.", "Students and staff utilising online platforms also achieve a commonality in technical functions and usage. Students and staff can transfer the skills and problem solve if issues arise.", "Reduction of wellbeing issues during NAPLAN due to online knowledge, student skills transfer and working within student-friendly platforms." ],
          "links" : [ "APST.2.5.2", "APST.2.6.2" ]
        },
        "delivering" : {
          "descriptions" : [ "At least 90% of students achieve at or above national minimum standards on NAPLAN reading, writing and numeracy." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "At least 35% of students achieve in the top two bands for NAPLAN reading, writing and numeracy." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Most students achieve in the top two bands for NAPLAN reading, writing and numeracy." ],
          "links" : [ ]
        }
      }, {
        "label" : "Student Growth",
        "links" : [ "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.1.4.2", "C.3.3.2", "C.3.3.3", "IMF.4.0", "IMF.6.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : [ "Automatic identification of areas of specific need for student growth and achievement and allocation of specific resources to assist at risk students.", "DoE Commons of resources (DLRH) linked to Literacy and Numeracy Progressions, Future Focused skills and ACARA general capabilities.", "Custom insight dashboards showing rigorous growth metrics to staff at point of need" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Insights into growth through accessible data for all staff. Ease of explanation of data to both staff and parents through appropriate channels online or face-to-face.", "All subjects are trackable online and reporting grade distribution to determine growth and spread is accessible for learning adjustments, extension and wellbeing support." ],
          "links" : [ "APST.5.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school identifies growth targets for individual students, using internal progress and achievement data." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Students are aware of – and most are showing – expected growth on internal school progress and achievement data." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school has identified what growth is expected for each student and students are achieving higher than expected growth on internal school progress and achievement data." ],
          "links" : [ ]
        }
      }, {
        "label" : "Internal and external measures against syllabus standards",
        "links" : [ "C.1.2.2", "C.1.3.1", "C.1.3.3", "C.3.3.2", "C.3.3.3", "IMF.4.0", "IMF.5.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Provide a DoE Commons for collection/sharing of syllabus aligned teaching and learning resources, targeted at specific learning needs identified/linked to external testing results. Includes automatic suggested resources for class groups and individual students designed to improve identified learning needs e.g. practice questions/review material.", "Integrated system that collates student learning data into single data centre and displays relevant metrics/graphs in a single dashboard.", "PLAN 2, NAPLAN, HSC Online data to be available in SCOUT." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Consistency of teacher judgment is more likely when learning is managed online – teachers can collaborate to develop internal assessment measures and data analysis that will possibly replicate and consolidate external measures.", "Using collaboratively planned programs, assessments and learning challenges that meet syllabus outcomes promotes best practice professional development for staff and equity of access to quality resources and accurate information for students." ],
          "links" : [ "APST.5.5.2", "APST.6.2.2", "APST.6.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school uses internal as well as external assessments (such as NAPLAN and HSC) to assess student progress and achievement against syllabus outcomes.", "School data shows that student progress and achievement on external measures is consistent with progress and achievement on internal assessments." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Students are aware of – and most are showing – expected growth on internal school progress and achievement data." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Progress and achievement of equity groups within a school is equivalent to the progress and achievement of all students in the school." ],
          "links" : [ ]
        }
      }]
    }]
  }, {
    "title" : "Teaching Domain",
    "links" : [ ],
    "topics" : [ {
      "title" : "Effective Classroom Practice",
      "cells" : [{
        "label" : "Lesson Planning",
        "links" : [ "C.1.1.1", "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.3.3", "C.1.4.2", "C.2.1.2", "C.2.2.1", "C.2.2.2", "C.2.2.3", "C.2.4.1", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.3.0", "IMF.4.0", "IMF.7.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Integrated workflow of lesson planning through to assessment, feedback and reporting across all phases of the teaching and learning cycle.", "Digital registration of programs/assessment including subject specific syllabus requirements, HSC and VET requirements, e.g. SharePoint work flows.", "Expanded functionality of NESA program builder to incorporate lessons specific syllabus tracking and calendar functionality.", "Online collaborative communities, to enable sharing of ideas, resources and knowledge e.g. Yammer.", "DoE Commons enabling sharing of teaching and learning resources, including automatically generated notification or push of suggested resources.", "Digital Daybook provide period-by-period calendar linked to registrations programs and to parent/student calendars.", "Faculty groups and sharing platforms for assessment, programs, lessons and learning challenges.", "Templates of lesson plans including pedagogy specific formatting e.g. Flipped Learning, Project Based Learning, SAMR, ALARM, etc.", "Data Lake: teachers pay teachers, edrolo etc." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Increased transparency of content and work samples to design learning around the outcomes and the needs of the students. Staff are also not replicating work from one year to the next as there is knowledge of what content has been taught and who has mastered that content.", "Lessons and programs can be co-designed and evaluated by faculties to improve teaching and learning cycles from both student, staff and parental feedback.", "Lessons, scope and sequences, programs and registration formats can be shared as a community bank of resources to assist staff in workload management and ensuring required content is delivered." ],
          "links" : [ "APST.2.2.2", "APST.2.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers regularly review and revise lesson plans and sequences, ensuring that the content is based on the curriculum and the teaching practices are effective.", "Teachers regularly use student progress and achievement data to inform lesson planning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers collaborate across faculties/ stages/teams to share curriculum knowledge, data, feedback and other information about student progress and achievement, to inform the development of evidence-based programs and lessons, which meet the needs of all students." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "All lessons are systematically planned as part of a coherent program that has been collaboratively designed. Accommodations and adjustments are made to suit needs as they arise. Lesson planning references student information including progress and achievement data, curriculum requirements, and student feedback, and provides continuous improvement for all students, across the full range of abilities." ],
          "links" : [ ]
        }
      }, {
        "label" : "Expicit Teaching",
        "links" : [ "C.1.1.2", "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.3.3", "C.1.4.2", "C.2.2.2", "C.2.2.3", "C.2.4.1", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.2.0", "IMF.3.0", "IMF.5.0", "IMF.7.0" ],
        "dleAspects" : {
          "descriptions" : [ "Promotion of, and access to available online professional development resources targeted at improving teacher quality in effective future focused teaching and learning strategies e.g. LinkedIn Learning, MyPL.", "Identification and collation of best practice teaching and learning resources by the DoE and community (as a “DoE stamp of approval”) (DLRH)", "Ability to record, share and manage explicit teaching including direct instruction lessons and stream or store them for viewing anywhere, anytime.", "Emphasis on future focused collaborative teaching and learning strategies." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Benefits for staff include the access to professional development online for teachers in rural and/or remote areas that cannot always travel. Same for staff with disabilities.", "Online professional learning provides equity of access to information and current strategies. Whilst there is a high value on face-to-face professional development and networking, developing relationships in person is an ultimate goal, however this may not always be possible or cost effective.", "This professional learning should foster, develop and consolidate effective and explicit teaching whilst also demonstrating best practice within schools and classrooms." ],
          "links" : [ "APST.2.1.2", "APST.6.3.2", "APST.6.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Explicit teaching is the main practice used in the school, reflecting the current evidence base. Teachers routinely and explicitly review previous content and preview the learning planned with students in each class." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers are skilled at explicit teaching techniques such as questioning and assessing to identify students’ learning needs, and use a range of explicit strategies to explain and break down knowledge." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "A whole school approach ensures the most effective evidence-based teaching methods optimise learning progress for all students, across the full range of abilities. Teachers employ evidence-based effective teaching strategies. Effective methods are identified, promoted and modelled, and students’ learning improvement is monitored, demonstrating growth." ],
          "links" : [ ]
        }
      }, {
        "label" : "Feedback",
        "links" : [ "C.1.1.2", "C.1.1.4", "C.1.2.1", "C.1.2.2" , "C.1.3.1" , "C.1.3.2" , "C.1.3.3" , "C.1.4.1" , "C.1.4.2" , "C.2.4.1" , "C.2.4.2" , "C.3.3.2" , "C.3.3.3" , "IMF.1.0" , "IMF.8.0" , "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Digital tools to enable explicit and timely feedback including digital ink, annotations, audio, video, text-to-speech and rubrics e.g. Speed Grader.", "Rubric creation to enable consistent and explicit expectations for students.", "Ability to track multiple submissions of documents and drafts; and provide the ability for students to digitally submit across multiple formats and platforms.", "Automatic general feedback and antiplagiarism capability to enable multiple draft submission of work and reduce marking times e.g. Turnitin, Speed Grader." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "To ensure all notifications are initially set up and can be tracked for ensuring all information is given to students, they can be timestamped and electronically signed.", "Online submissions can also be tracked for drafts, feedback given and re-submission of work addressing improvements that need to be made.", "If multiple staff are marking tasks, feedback can be tracked, consistent judgments can be made and feedback can go to the students in a more timely and effective manner." ],
          "links" : [ "APST.5.2.2", "APST.5.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers respond promptly to student work. They check that students understand the feedback received and the expectations for how to improve." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers provide explicit, specific and timely formative feedback related to defined success criteria.", "Teachers’ feedback supports improved student learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teachers routinely review learning with each student both in class and on work submitted, ensuring all students have a clear understanding of how to improve. Student feedback is elicited by teachers and informs their teaching. Student errors and misunderstandings are explicitly addressed until teachers and students are confident that mastery is demonstrated." ],
          "links" : [ ]
        }
      }, {
        "label" : "Classroom management",
        "links" : [ "C.1.1.2", "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.4.1", "C.1.4.2", "C.2.1.1", "C.2.1.2", "C.2.2.1", "C.2.2.2", "C.2.2.3", "C.2.4.1", "C.2.4.2", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.3.0", "IMF.4.0", "IMF.8.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Increase student engagement in learning through individualised interest based curriculum. Including syllabus aligned resource repository linked to individual student data profile across all relevant system e.g. 3PI.", "Timetabling: use of effective timetabling software and techniques to ensure students are placed in classes which provide the best possible support for their wellbeing and learning needs, e.g. EDVAL, Sentral Class builder.", "Digital monitoring of student activity and engagement during class time and on T4L devices.", "Lock Down browser (or similar) to ensure student remain on task, particularly during formal assessment task e.g. NAPLAN Lock Down Browser.", "Student administration: access to digital profiles and flags for all staff including casuals to ensure consistency of expectations and accommodation of learning for all students.", "Digital seating plans and daybooks ensure teachers and casuals provide a consistent and safe learning environment." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Decrease wellbeing incidents through increased engagement", "Staff organisation, course programs and lesson transparency support productive and positive classroom management. Well sequenced lessons and student ability to engage in learning, self-regulate and self-differentiate through lessons (“I do, we do, you do�?) to achieve mastery, deep knowledge and deep understanding. If students are engaged in topics that they are interested in and/or methods of learning that they enjoy, they are more likely to not disrupt their own or other people’s learning. The same applies for teaching staff – if they are prepared, confident and enthusiastic in their lesson preparation and organisation, they will have more time to assist students and facilitate learning in class rather than teaching from the front." ],
          "links" : [ "APST.3.2.2", "APST.3.3.2", "APST.3.4.2", "APST.3.5.5" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers maintain orderly classrooms and manage challenging behaviour to create a positive environment for learning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "A school-wide approach to effective and positive classroom management is evident. Support is provided to teachers where needed, ensuring optimum learning." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "All classrooms and other learning environments are well managed within a consistent, school-wide approach. Well planned teaching is taking place, so that all students can engage in productive learning, with minimal disruption. Teachers model and share a flexible repertoire of strategies for classroom management and promotion of student engagement and responsibility for learning." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Data Skills and Use",
      "cells" : [{
        "label" : "Data Literacy",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.2.1", "C.3.1.1", "C.3.1.4", "C.3.2.3", "C.3.3.2", "C.3.3.3", "IMF.6.0", "IMF.9.0", "IMF.11.0" ],
        "dleAspects" : {
          "descriptions" : [ "Targeted online professional development of staff to enable practical and efficient use of available data.", "Reduction of technical knowledge requirements for teachers and executive to view and analyses data.", "SCOUT (Power BI) dashboards." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online access to data for staff and explanations of data (professional learning) to give understanding and interpretation. Staff understanding of the meta-language surrounding data analysis and the reasoning behind using data for learning entry/exit points. Online glossary of terms and MyPL learning in Scout and Big Data concepts." ],
          "links" : [ "APST.5.4.2", "APST.5.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers access and engage in professional learning that builds skills in the analysis, interpretation and use of student progress and achievement data." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school promotes and demonstrates professional learning in data concepts, analysis and use of student assessment data and related tools.", "Teachers use data effectively to evaluate student understanding of lesson content ." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "All teachers have a sound understanding of student assessment and data concepts (e.g. causality, bias). They analyse, interpret and extrapolate data and they collaboratively use this to inform planning, identify interventions and modify teaching practice." ],
          "links" : [ ]
        }
      }, {
        "label" : "Data Analysis",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.2.1", "C.3.1.1", "C.3.1.4", "C.3.3.2", "C.3.3.3", "IMF.3.0", "IMF.4.0", "IMF.5.0", "IMF.8.0", "IMF.9.0" ],
        "dleAspects" : {
          "descriptions" : [ "Single dashboard for data analysis across all platforms, including automatically generated metrics and graphs specific to teacher/school identified needs.", "Simplified process of collection, collation and analysis of data specific to school needs or requirements.", "Automatic push notification of most important/relevant data or information to data dashboard.", "Role specific automatic data filtering, to enable point of need analysis e.g. Principal, DP, Head Teacher, Year Advisor, etc.", "Consistent data model for all DoE schools, including data entry and retention." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Automated data analysis programs demonstrating analytics to access data from individual student data to whole school insights to save time in gathering information. School leaders can determine school based performance by pre-populated data from a variety of sources to evaluate and target learning and future goals.", "Programs can also be populated with school made questionnaires to gather specific data related to the community. These can then be used in conjunction with overall NAPLAN data, TTFM, attendance data etc. to gather a tailor made picture of performance for analysis.", "Data filtration and targeting specific information automated for quick access." ],
          "links" : [ "APST.5.4.2", "APST.5.4.3", "APST.5.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team regularly uses student progress and achievement data to inform key decisions such as resourcing and implementation of new programs or initiatives." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team comprehensively analyses student progress and achievement data for insights into student learning and discusses results with the whole staff.", "All teachers contribute to gathering and analysing data." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The learning goals for students are informed by analysis of internal and external student progress and achievement data. Progress towards goals is monitored through collection of quality, valid and reliable data. Reporting on school performance is based on valid and reliable data and analysis." ],
          "links" : [ ]
        }
      }, {
        "label" : "Data Use in Teaching",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.2.1", "C.3.1.1", "C.3.1.4", "C.3.3.2", "C.3.3.3", "IMF.3.0", "IMF.4.0", "IMF.5.0", "IMF.7.0", "IMF.8.0", "IMF.9.0" ],
        "dleAspects" : {
          "descriptions" : [ "Automatic analysis of standardised testing results to identify individual areas of needs for students and push of review or practise material to support learning progression.", "Online professional development of, and identification and sharing of best practice data analysis procedure and policy.", "Data ‘insights’ dashboard for all relevant staff, e.g. head-teachers." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Professional development online – targeted to educational analysis and methods for use of data and collaborative reflection as a school staff or a faculty.", "Assessment strategies shared in a common area to illustrate best practice and align to other shared programs, scope and sequences, lesson plans etc.", "Staff professional learning also seen to identify learning gaps and improve knowledge, not as a punitive measure on staff performance.", "(As above) Automated data collection and analysis to save time and administrative burden on staff.\n" ],
          "links" : [ "APST.5.4.2", "APST.5.4.3", "APST.5.4.4" ]
        },
        "delivering" : {
          "descriptions" : [  "Teachers review student assessment data and compare results from external assessments (e.g. NAPLAN, ICAS, PAT, HSC) with internal measures to build consistent and comparable judgement of student learning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Assessments are developed/sourced and used regularly across stages/year levels/ subject areas or the whole school to help promote consistent and comparable judgement of student learning, monitor student learning progress, and identify skill gaps for improvement and areas for extension." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teachers clearly understand, develop and apply a full range of assessment strategies – assessment for learning, assessment as learning and assessment of learning – in determining teaching directions, monitoring and assessing student progress and achievement, and reflecting on teaching effectiveness." ],
          "links" : [ ]
        }
      }, {
        "label" : "Data use in planning",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.2.1", "C.2.1.1", "C.2.1.2", "C.2.1.4", "C.2.2.3", "C.3.1.1", "C.3.1.4", "C.3.3.2", "C.3.3.3", "IMF.5.0", "IMF.7.0", "IMF.8.0", "IMF.9.0", "IMF.11.0", "IMF.12.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Analysis by school executive of TTFM, SMART data, SCOUT and internal staff surveys to ensure strategic directions meet the needs of the whole school community and stakeholders, especially students.", "Transition of K-12 data including; student profiles, academic records, wellbeing and learning portfolios to enable planning for needs of individual students and cohorts and groups of students.", "School Plan and Milestoning available online and completed in a transparent manner.", "Consistent strategic planning milestones for school directorates and regions based on specific needs and requirements." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "School community can collaborate to design learning, teaching and leading programs for improvement measures within school planning periods based on accurate and transparent data online.", "Milestones, plans and data entry is simplified due to online platforms; some importing data from the source (excessive data transfer and handling) does not cause errors. Adjusting information online is done in one place and shared to other platforms instantly for live updates and currency.", "Students and staff can have data follow them through their school and teaching careers making human transfer between schools easier to achieve.", "Management strategies shared in a common area to illustrate best practice and align to other shared programs, scope and sequences, lesson plans etc." ],
          "links" : [ "APST.5.4.2", "APST.5.4.3", "APST.5.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Clear and accurate analysis of student progress and achievement data informs planning that is shared with the school community in the Annual Report." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "There is a coordinated effort by school staff to engage the school community to reflect on student progress and achievement data and develop plans and strategies for improvement." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "School staff collaborate with the school community to use student progress and achievement data to identify strategic priorities, and develop and implement plans for continuous improvement.", "Strategies implemented reflect research on best practice and include ongoing monitoring of success." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Professional Standards",
      "cells" : [{
        "label" : "Improvement Practice",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.4.2", "C.3.2.2", "C.3.2.3", "C.3.3.2", "C.3.3.3", "IMF.6.0", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "PDP completed online in consistent format and template, linking to school based and external professional development.", "Tracking of professional development applications online ensure teachers are meeting the professional goals set in in their PDP, i.e. SharePoint.", "Reduction of redundant training through monitoring of whole school professional development to identify strength and gaps and ensure whole school priorities and strategic directions are evenly addressed.", "Online sharing of professional development resources, notes and conference materials to ensure the whole school can benefit from offsite professional development." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "The standards are automatically built into online forms, administration and are at the forefront of professional development and administration.", "Professional development is planned based on surveys to determine the most appropriate course of action for staff. Whole school analysis – resources, links and documents can all be shared quickly and easily online." ],
          "links" : [ "APST.5.4.2", "APST.5.4.3", "APST.5.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers use the Australian Professional Standards to measure themselves, reflect on their practice and plan for and monitor their own professional development to improve their performance." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers’ Professional Development Plans are supported by a coordinated whole school approach to developing professional practice, informed by research. Whole school analysis of the teaching staff identifies strengths and gaps, with planning in place to build capabilities and source teachers with particular expertise to improve student learning outcomes." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school has a high performing teaching staff as measured against the Australian Professional Standards, whose capacities are continually built to ensure every student experiences high quality teaching. The leadership team has participated in capacity development programs and implements principles of evaluative thinking, continually monitors the impact of programs and approaches used by all teachers, and improves practice as required." ],
          "links" : [ ]
        }
      }, {
        "label" : "Accreditation",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.3.1.3", "C.3.2.1", "C.3.2.2", "C.3.2.3", "C.3.2.4", "C.3.3.2", "C.3.3.3", "C.3.6.5", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online tracking of professional development completed including registered and non-registered hours for all PD activities.", "Automatic tracking of APTS completed and linked to all PD offered within a school or region.", "MyPL LTI or API linked to online learning resources to ensure all PD hours undertaken by staff are recorded and accounted for efficiently.", "Single dashboard for Executive to monitor accreditation requirement for staff within a school.", "Support of higher levels of accreditation available online, including workflows and templates for completing proficient, highly accomplished and lead requirements." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Transparent system between NESA and DoE (including one set of procedures, not NESA and DoE procedures).", "Benefits of online learning system would be increase the number of staff completing higher levels of accreditation due to linking of PDPs, programs, teaching and learning systems and online resources linked to the level that is being aimed for.", "Staff also deliver (either online or face-to-face) exemplars of practice for their proficiency reports to determine quality samples of accreditation evidence.", "Universities link more with the DoE in regards to needs for beginning teacher practicums and internships such as the WWCC and other compliance areas.", "Greater transparency of evidence for higher levels of standards and support for staff attempting to reach these goals. School supervisor could deem from evidence without having to book in NESA supervisor. School TAA / Principal could have professional judgment over the system to establish final standards in supervision time required.", "Benefits are also cost saving and might encourage more into the program." ],
          "links" : [ "APST.6.1.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers’ attainment of their professional goals in their PDPs and their maintenance of accreditation are supported by the school." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school monitors the accreditation status of all staff and encourages the pursuit of higher levels of accreditation.", "All teachers use professional standards and PDPs to identify and monitor specific areas for development or continual improvement." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "A high proportion of the teaching staff (including specialist teachers) have attained and are maintaining accreditation at Highly Accomplished or Lead teacher professional standards and/or there is a strong, visible culture in the school that promotes and supports the attainment of higher level accreditation, with an increasing proportion of teachers at preliminary stages of the higher level accreditation process." ],
          "links" : [ ]
        }
      }, {
        "label" : "Literacy and numeracy focus",
        "links" : [ "C.1.1.2", "C.1.2.1", "C.1.2.2", "C.1.3.1", "C.1.4.2", "C.3.2.2", "C.3.2.3", "IMF.1.0", "IMF.2.0", "IMF.4.0", "IMF.7.0", "IMF.8.0" ],
        "dleAspects" : {
          "descriptions" : [ "Literacy and numeracy professional development resource available online 24/7 and linked to the APST.", "Online KLA based collaborative communities related to subject/stage needs for literacy and numeracy within schools, regions and state.", "Automatic identification of targeted literacy and numeracy activities related to individual student needs." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Students are tracked and monitored online and data is automatically transferred from task marking rubrics, NAPLAN results (or any other recognised diagnostic testing e.g. VALID, Best Start etc.). Teachers do not have to transfer the data themselves, thus preventing double handling of data and reducing the possibility of errors. Staff can then provide quality teaching and learning based on the data and target the levels of students to improve student outcomes.", "Data analysis also begins using tools to help analyse the literacy and numeracy results of students. Professional development is provided at a Departmental level to ensure all staff are aware of the use of qualitative and quantitative data analysis specific to literacy and numeracy in both K-6 and 7-12 settings.", "The automatic transference of data also links to the learning progressions – specific questions in NAPLAN can be directly correlated and plotted online automatically." ],
          "links" : [ "APST.1.5.2", "APST.2.5.2", "APST.5.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school provides/facilitates professional learning that builds teachers’ understanding of effective strategies in teaching literacy and numeracy skills and knowledge." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers are proficient in their teaching of literacy and numeracy, meeting the needs of students in their subject/stage." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "All teachers understand and explicitly teach literacy and numeracy to students at all levels of achievement, in all subject areas, with success that can be measured by improved student progress and achievement data." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Learning and Development",
      "cells" : [{
        "label" : "Collaborative practice and feedback",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.2.2", "C.1.3.1", "C.1.3.2", "C.1.4.2", "C.2.4.2", "C.3.3.2", "C.3.3.3", "IMF.2.0", "IMF.4.0", "IMF.6.0", "IMF.7.0", "IMF.8.0", "IMF.10.0" ],
        "dleAspects" : {
          "descriptions" : [ "Enable collaborative professional practice using online collaborative tools and communities. Includes educational resources sharing, modification and distribution tools (DoE “Commons”).", "Enable (opt-in) standardised observation of professional teaching rounds and practice including tracking of completion and identification of areas of professional learning need.", "Enable remote classroom observation and collaboration using digital conferencing tools e.g. Teams." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online communities of practice share resources (both human and learning). Subject / topic experts are able to co-teach online, in particular when students are learning through either distance education, or support new staff and their students in hard to staff areas across NSW.", "Staff can also use learning observations that have been documented for future accreditation evidence and annotations.", "Staff can also engage in cross-curricular discussions, with the possibility of completing projects, meeting outcomes from different KLAs." ],
          "links" : [ "APST.6.2.2", "APST.6.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Executive, staff, faculty/stage, team and other meetings are used to review the curriculum and to revise teaching practices and learning programs to meet the needs of learners, based on evidence of student progress and achievement." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers engage in professional discussion and collaborate to improve teaching and learning in their classes, year groups, stages, faculties, or for particular student groups. This includes negotiated observations of classroom teaching practice, with feedback, to improve professional knowledge and practice." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school uses embedded and explicit systems that facilitate professional dialogue, collaboration, classroom observation, the modelling of effective practice and the provision of specific and timely feedback between teachers. This drives ongoing, school-wide improvement in teaching practice and student results." ],
          "links" : [ ]
        }
      }, {
        "label" : "Coaching and mentoring",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.3.1", "C.1.4.2", "C.2.4.2", "C.3.3.2", "C.3.3.3", "IMF.1.0", "IMF.2.0", "IMF.6.0", "IMF.7.0", "IMF.10.0", "IMF.11.0", "IMF.12.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online creation of collaborative communities organised to collate and share best practice teaching and learning examples", "Utilisation of group/class collaboration tools enabling chat, discussion, file sharing, workflow, audio and video streaming.", "Access to international experts through online coaching and training webinars and recording e.g. Breaky with a techy, Webcast Wednesday." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Schools can self-regulate professional learning needs and create courses on MyPL.", "LinkedIn Learning can also be integrated into professional learning and registered through MyPL for required hours.", "Communities of learning can support teachers and aspirant leaders, providing networking and collaboration on a range of subjects. Schools may have already developed online Leadership training to assist capacity building in their regions.", "Accreditation support online and sample proficiency reports shared among staff to assist best practise." ],
          "links" : [ "APST.6.1.2", "APST.6.2.2", "APST.6.3.2" ]
        },
        "delivering" : {
          "descriptions" : [ "The school’s structure and organisation ensure that direct support is available to new staff members from experienced teachers, and beginning teachers are mentored" ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Formal mentoring or coaching to improve teaching and develop aspiring leaders is provided to teachers who request it or are identified as in need of support." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Whole school and/or inter-school relationships provide mentoring and coaching support to ensure the ongoing development and improvement of all teachers, by expert teachers such as those accredited at Highly Accomplished or Lead." ],
          "links" : [ ]
        }
      }, {
        "label" : "Professional Learning",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.4.2", "C.3.2.2", "C.3.2.3", "C.3.2.4", "C.3.3.2", "C.3.3.3", "IMF.6.0", "IMF.10.0", "IMF.11.0", "IMF.12.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online training and professional development included future focused pedagogies and leadership resources (LinkedIn Learning)." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Schools can use the PDPs to target professional learning every year – via a survey to ensure the analytics are accurate and trackable. Once this is ascertained, an in school professional development plan can be developed for all staff. Blended learning packages can be developed for schools utilising a range of face to face, team or online learning depending on the expertise of presenters available etc.", "Staff can evaluate the learning after all Staff Development Days, complete compliance evaluations on MyPL and return the learning from conferences and external professional development. This learning can also be accessed online if staff choose to upload the learning for others to utilise on to the chosen system." ],
          "links" : [ "APST.6.4.2", "APST.7.2.2", "APST.7.4.2" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers engage in professional learning targeted to school priorities, the needs of their students, and the achievement of their professional goals." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teachers actively evaluate, share and discuss learning from targeted professional development with other staff in their school to improve whole school practice." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The staff evaluate professional learning activities to identify and systematically promote and implement the most effective strategies to improve teaching and learning.", "Teachers collaborate with staff in other schools to share and embed good practice." ],
          "links" : [ ]
        }
      }, {
        "label" : "Expertise and innovation",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.2.2", "C.1.4.2", "C.2.4.2", "C.3.2.3", "C.3.2.4", "C.3.3.2", "C.3.3.3", "IMF.6.0", "IMF.10.0", "IMF.11.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online tracking of PDP priorities and areas of expertise and need in regard to school wide expertise and knowledge.", "Provide opportunities for promotion and professional development and training related to Future Focus Digital Learning Environments." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Staff can develop professional learning communities through network meetings and online forums. Filming of best practise presentations, teaching and learning (with all required permissions) and demonstrate innovation. All these can be shared across schools, regions and states to support professional development using similar or shareable software systems. Success can be scaled using video and is cost effective for schools." ],
          "links" : [ "APST.6.1.4", "APST.6.4.3", "APST.6.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Teachers demonstrate currency of content knowledge and evidence-based teaching practice in all their teaching areas.", "Technology and learning spaces are utilised to enhance student learning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school identifies expertise within its staff and draws on this to further develop its professional learning community. Areas for development in teacher expertise are identified and addressed. Teachers are supported to trial innovative or evidence-based, future-focused practices." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Teaching staff demonstrate and share their expertise within their school and with other schools. All teachers have expert contemporary content knowledge and deploy effective teaching strategies. The school trials innovative practices and has processes in place to evaluate, refine and scale success." ],
          "links" : [ ]
        }
      }]
    }]
  }, {
    "title" : "Leading Domain",
    "links" : [ ],
    "topics" : [ {
      "title" : "Educational Leadership",
      "cells" : [{
        "label" : "Instructional leadership",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.4.2", "C.3.2.3", "C.3.3.2", "C.3.3.3", "IMF.6.0", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.12.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Tracking of professional learning goals for all staff and ability of executive and line managers to see whole school priorities in an easy to read dashboard. (PDP/QTR)", "Online access to professional learning available for all staff including curricular and non-curricular skills based content and knowledge e.g. LinkedIn Learning.", "Online repository of professional learning resources inducing staff development day or internal and external PD." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "From staff completing their PDPs online, surveys can be completed to ascertain a needs analysis for annual school professional development plans. From there, staff experts can be identified to lead projects, professional development, evidenced based teaching (QTR management) meeting all guidelines.", "All professional development stored online as a tracking system for future staff use, links to online training e.g. LinkedIn Learning and calendar records with standards attached to assist in accreditation monitoring.", "This assists in student progress as staff can access information 24/7 for professional learning, training and clarification." ],
          "links" : [ "APST.6.2.2", "APST.6.2.3", "APST.6.1.3", "APST.6.1.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team ensures that implementation of syllabuses and associated assessment and reporting processes meet NESA and Department of Education requirements, forming a sound basis for student learning." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Professional learning in the school emphasises developing effective instructional leadership, management skills and leadership attributes to facilitate whole school improvement and build a strong pipeline of leaders." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The leadership team maintains a focus on distributed instructional leadership to sustain a culture of effective, evidence-based teaching and ongoing improvement so that every student makes measurable learning progress and gaps in student achievement decrease." ],
          "links" : [ ]
        }
      }, {
        "label" : "High expectations culture",
        "links" : [ "C.1.1.1", "C.1.1.4", "C.1.4.2", "C.3.1.1", "C.3.2.3", "C.3.3.2", "C.3.3.3", "IMF.10.0", "IMF.11.0" ],
        "dleAspects" : {
          "descriptions" : [ "School planning documentation placed online in a transparent and consistent manner.", "School, region and state-wide training available 24/7 in a single location online.", "Professional networks available and promoted in online collaborative communities e.g. Yammer, MS Teams.", "Identification of best practice examples and school in context of regional priorities." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online management of PDPs, QTR and 2IC style programs.", "Online management of staff surveys, data from TTFM and evaluations from professional development." ],
          "links" : [ "APST.6.3.4", "APST.6.4.4", "APST.7.1.3", "APST.7.1.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team ensures that the teacher performance and development policy is implemented in a culture of high expectations for every staff member." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team develops processes to collaboratively review teaching practices to affirm quality and to challenge and address underperformance." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The leadership team establishes a professional learning community which is focused on continuous improvement of teaching and learning." ],
          "links" : [ ]
        }
      }, {
        "label" : "Performance management and development",
        "links" : [ "C.1.1.1", "C.1.1.3", "C.1.4.2", "C.3.2.3", "C.3.2.4", "C.3.3.2", "C.3.3.3", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "Monitor individual and whole school PD goals online in an easy to read dashboard.", "Tracking of school wide professional learning goals and expertise.", "Online Professional development applications, approval and tracking e.g. InfoPath/SharePoint.", "Easy to join and manage collaborative learning environments and communities available and relevant to all staff." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "PDPs can be managed online and shared with managers / supervisors using electronic signatures.", "Observations can be recorded and monitored online.", "Role management (who does what and when – e.g. CCWC DPMS system) checklist.", "Best practise samples of teaching, learning, accreditation and monitoring documents are all stored online and accessible to all through a transparent system." ],
          "links" : [ "APST.5.5.4", "APST.6.1.4", "APST.6.3.4", "APST.6.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team undertakes annual staff performance and development reviews for teaching and non-teaching staff.", "Poor performance is identified and managed promptly and effectively." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Teaching and non-teaching staff proactively seek to improve their performance. The school supports collaborative performance development and efforts to continuously monitor improvement." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school demonstrates a high performance culture, with a clear focus on student progress and achievement and high quality service delivery. All students are taught by high performing teachers, and the leadership team supports the recognition of this through the teacher accreditation process." ],
          "links" : [ ]
        }
      }, {
        "label" : "Community engagement",
        "links" : [ "C.1.4.1", "C.3.7.1", "C.3.7.2", "C.3.7.4", "C.3.7.5", "C.3.7.6", "IMF.2.0", "IMF.8.0", "IMF.9.0" ],
        "dleAspects" : {
          "descriptions" : [ "Enable online collaborative communities and social networks to enable parent and community involvement and communication with the school.", "TTFM-parent and teacher surveys to inform community expectations, priorities and goals.", "DoE “Commons�? (regional / worldwide) sharing of curriculum aligned educational resources." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Feedback is sourced through TTFM and data analysed by staff, focus groups are also represented and data/ideas stored online for all staff to access. Other survey feedback from parents is completed online using tools that can provide survey analytics quickly for staff to then research and analyse.", "Social media is utilised with community engagement, as the speed of push notifications to parents/caregivers is rapid." ],
          "links" : [ "APST.7.3.2", "APST.7.3.3", "APST.7.3.4", "APST.3.7.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Parents and community members have the opportunity to engage in a range of school-related activities which help build the school as a cohesive educational community." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school regularly solicits and addresses feedback on school performance from students, staff, parents and the broader school community." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school is recognised as excellent and responsive by its community because it uses best practice to embed a culture of high expectations, and effectively caters for the range of equity issues in the school." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "School Planning and Leadership",
      "cells" : [{
        "label" : "Continuous improvement",
        "links" : [ "C.1.1.1", "C.1.1.2", "C.1.1.3", "C.1.1.4", "C.1.4.2", "C.3.1.1", "C.3.1.4", "C.3.2.3", "C.3.2.4", "C.3.3.1", "C.3.3.2", "C.3.3.3", "C.3.7.1", "IMF.6.0", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "School milestones completed dynamically online with links to evidence for external validation within the documentation e.g. SharePoint. (Data harbour)", "Promote awards and school profile via social media and target events including T4L Awards, etc.", "School plan continually reviewed online to inform the status of milestones. Including review of continuous feedback from staff, students and the community e.g. TTFM.", "Provide online access to leadership and capacity building professional development including internal and external providers e.g. LinkedIn Learning/staff orientation." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Collaborative processes online to complete planning for the school plan, milestones, use of linked surveys for feedback and ease of hyperlinks to data / evidence for validation and/or registration. This is also ensuring that the team members / Principals and Directors can all be linked into the same documents to ensure correct monitoring. Best practise and support can also be easily shared across platforms." ],
          "links" : [ "APST.1.6.4", "APST.2.1.4", "APST.2.5.4", "APST.3.4.4", "APST.3.6.4", "APST.4.1.4", "APST.4.4.4", "APST.4.5.4", "APST.5.1.4", "APST.5.3.4", "APST.5.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team engages in a process of planning, implementation, monitoring and self-assessment, and leads the collaborative development of evidence-based school plans." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team actively supports change that leads to improvement, creating opportunities where feedback about the impact of change can be shared and monitored." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school is recognised as a leader for its impact on learning progress, its effective practices and continuous improvement, and its active support of (improvement in) other schools." ],
          "links" : [ ]
        }
      }, {
        "label" : "School Plan",
        "links" : [ "C.1.4.1", "C.1.4.2", "C.3.1.1", "C.3.1.4", "C.3.3.1", "C.3.3.2", "C.3.3.3", "C.3.7.1", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.13.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online and transparent school planning processes and publishing of School Plan to School Website Service (SWS).", "SPaRO used to complete school planning and reporting processes online. (Data harbour)", "School and corporate DoE tracking of school plan using single online system/approach including ongoing and dynamic tracking of strategic milestones.", "Evidence available online – and linked to SharePoint or similar system for ease of external validation.", "TTFM for Parents and Staff – such as for term 3 test" ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "The school plan is the overarching road map that defines the SEF (V2) for the school through the annual professional development plan, annual milestones and the links to improvements measures. These can all link together online easily for staff access and SpARo can be utilised for tracking and monitoring. Support documents and evidence are accessible as either attachments or noted as a link. Research and professional learning resources can also be saved with these files to assist with staff understanding of the school plan and its use. 24/7 access for staff ensure that it can be re-visited at any occasion." ],
          "links" : [ "APST.7.2.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school plan aligns to student and system priorities and ensures responsiveness to emerging needs.", "Staff, students, parents and the broader school community are welcomed and engaged, where possible, in the development of the vision, values and priorities of the school." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team embeds clear processes, with accompanying timelines and milestones, to direct school activity towards effective implementation of the school plan.", "Staff understand what they need to do to help address the school plan’s strategic directions and meet the school’s improvement measures." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school uses research, evidence-based strategies and innovative thinking in designing and implementing a school plan that successfully delivers ongoing, measured improvement in student progress and achievement." ],
          "links" : [ ]
        }
      }, {
        "label" : "Annual report",
        "links" : [ "C.3.1.1", "C.3.1.4", "C.3.7.1", "C.3.7.4", "IMF.10.0", "IMF.11.0", "IMF.13.0" ],
        "dleAspects" : {
          "descriptions" : [ "ASR online and available via SWS and social media with the ability to communicate with the community and manage feedback.", "Provide links with ASR to school plan, strategic milestones and any other relevant publicly available documentation." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "The ASR is a culmination of a year’s work, sourced from the school plan, online evidence leading to the completion of milestones and linking improvement measures, finance and human resources to results, programs – academic, sporting and cultural. Online management from a system to SpARo is crucial to manage the amount of data and information required to complete the ASR." ],
          "links" : [ "APST.5.5.4", "APST.7.2.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school collects and analyses learning and wellbeing data to monitor the achievement of milestones and review, self-assess and report performance annually." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "In the annual report, the school reports on the alignment of resource allocation, professional learning, and the monitoring of student data with the plan’s strategic priorities." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school systematically and regularly monitors a range of indicators to gauge the impact of its plan and to inform changes to the implementation that support its ultimate success.", "The annual report contains data that measures the impact of the plan in terms of student learning progress." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "School Resources",
      "cells" : [{
        "label" : "Staff Deployment",
        "links" : [ "C.2.2.3", "C.2.2.1", "C.3.1.1", "C.3.1.2", "C.3.1.4", "C.3.2.1", "C.3.2.2", "C.3.2.3", "C.3.2.4", "C.3.2.5", "C.3.3.2", "C.3.3.3", "C.3.7.1", "IMF.2.0", "IMF.9.0", "IMF.10.0", "IMF.11.0", "IMF.13.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Single system for entry and identification of staffing role and associated responsibilities e.g. EBS, IDM.", "Delegation of responsibility based on roles assigned in IMU. Including automatic enrolment of staff into related professional development and faculty groups.", "Management and completion tracking of non-educational administrative task is streamlined process and single location online e.g. SharePoint Online.", "Locally developed and specialised roles available to schools based on size, and specific need e.g. Business Manager, TSO, HT IT, etc." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "The school has access to what staff can teach, what they are willing to teach and the Year levels they can teach to ensure human resources are allocated correctly in timetables.", "Tasks that are specifically ‘non-teacher’ tasks are assigned to appropriate staff to ensure effective time and strategic management.", "A task ‘audit’ to be more strategic with job descriptions could occur online to ensure staff are employed for areas of need e.g. TSOs, paraprofessionals, business managers etc." ],
          "links" : [ "APST.7.2.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school’s staffing is organised and managed to ensure an effective learning environment. The leadership team allocates staff resources to support the achievement of the school’s strategic priorities." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team allocates non-educational administrative tasks to appropriate non-teaching staff. All staff use technology available to streamline the administrative practices of the school." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The leadership team deploys teaching and non-teaching staff to make best use of available expertise to meet the needs of students. The leadership team uses data to evaluate the effectiveness of management processes, and creates a culture of shared accountability to achieve organisational best practice." ],
          "links" : [ ]
        }
      }, {
        "label" : "Facilities",
        "links" : [ "C.1.3.2", "C.3.3.1", "C.3.3.2", "C.3.3.3", "C.3.3.4", "C.3.5.3", "C.3.5.5", "C.3.5.6", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Digital infrastructure including equity of access to software, hardware and network infrastructure", "1:1 computer access for digital assessment and differentiated educational opportunities.", "Specialist labs for faculties e.g. art software, music software, TAS software, ICT. Etc.", "Digital dashboard for analysing utilisation of ICT and faculty based resources." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Specialist online programs for different faculties. Research is also completed in effective learning spaces e.g. Future Learning professional development. Timetabling and access are considered in planning." ],
          "links" : [ "APST.3.4.4", "APST.4.1.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school’s physical resources and facilities are well maintained and provide a safe environment for learning" ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Physical learning spaces are used flexibly to meet a broad range of student learning interests and needs." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The leadership team takes a creative approach to use of the physical environment to ensure that it optimises learning, within the constraints of the school design and setting." ],
          "links" : [ ]
        }
      }, {
        "label" : "Technology",
        "links" : [ "C.1.1.2", "C.1.3.1", "C.2.2.1", "C.2.2.2", "C.3.3.1", "C.3.3.2", "C.3.3.3", "C.3.3.4", "C.3.5.3", "C.3.5.5", "IMF.2.0", "IMF.12.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Resource booking and allocation to be completed online ensuring all school based resources are equitably distributed and utilised. (Learning Spaces)", "Access to devices that are well serviced, easy to use and of a high quality e.g. SSO.", "TSOs in schools to support implementation, maintenance and management of hardware and software.", "1:2 ratio of devices to students, ensure equity of access to technology and services.", "1:1 ratio of staff devices, ensuring all staff can utilise required, systems and services." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Accessibility is 24/7 for all staff, Digital Learning Environment is accessible 24/7 for students and parents/caregivers.", "Systems are transparent, professional development is provided and access is equitable.", "Sharing and community practise is common through similar systems." ],
          "links" : [ "APST.2.6.4", "APST.3.4.4o", "APST.4.5.4", "APST.7.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Technology is accessible to staff and students." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Technology is effectively used to enhance learning and service delivery." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Technology that supports learning is available and expertly integrated into lessons by teachers.", "Administrative staff are expert users of available technology and systems." ],
          "links" : [ ]
        }
      }, {
        "label" : "Community use of facilities",
        "links" : [ "C.3.3.1", "C.3.5.1", "C.3.5.2", "C.3.5.3", "C.3.5.4", "C.3.5.5", "C.3.5.6", "C.3.6.1", "C.3.6.2", "C.3.6.3", "C.3.6.4", "C.3.6.5", "C.3.7.1", "C.3.7.5", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "24/7 access to digital resources and appropriate software for students and community.", "Ability to apply for and manage the community use of facilities as per the need of individual schools (online booking or management of commonly used facilities)." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online physical spaces are 24/7, however management of facilities can be done online." ],
          "links" : [ "APST.7.3.4", "APST.7.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The school plans for community use of school facilities." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Use of school facilities by the local community delivers benefits to students." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school collaborates with the local community where appropriate on decisions about − and access to − school assets and resources, delivering benefit to both the school and the community." ],
          "links" : [ ]
        }
      }, {
        "label" : "Financial management",
        "links" : [ "C.2.3.1", "C.2.3.2", "C.2.3.3", "C.3.3.2", "C.3.3.3", "C.3.3.4", "C.3.4.1", "C.3.5.3", "C.3.7.5", "IMF.13.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "School based finance system that supports fee paying and financial assistance for students and parents e.g. School Bytes.", "Consistent template of contracts, expectations and legal requirements for engaging 3rd party vendors.", "Marketplace for procurement of 3rd party SaaS (Software and a Service) applications e.g. Turnitin, Lockdown Browser, Canvas providing economies of scale and appropriate procurement practises." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Efficient programs that ‘talk’ to each other and can have links to the school plan." ],
          "links" : [ "APST.7.2.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The priorities in the school plan drive financial decisions." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Strategic financial management is used to gain efficiencies and to maximise resources available to implement the school plan." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Longer-term financial planning is integrated with school planning and implementation processes to address school strategic priorities and meet identified improvement goals." ],
          "links" : [ ]
        }
      }]
    }, {
      "title" : "Management Practices and Processes",
      "cells" : [{
        "label" : "Administrative systems and processes",
        "links" : [ "C.3.3.2", "C.3.3.3", "C.3.5.3", "C.3.7.5", "IMF.9.0", "IMF.13.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Utilise currently available DoE administrative processes and systems including SharePoint and MS Teams.", "Consistent template of staff required compliance and administrative requirements using SharePoint and approved by DoE for purposes of validation.", "Compliance dashboard for principals to monitor and manage staff compliance across WHS, NESA, MyPL and DoE.", "ICT PLUS dashboard for principal and IT managers to make informed decisions on management, maintenance and procurement of ICT solutions with schools." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online management of resources is cost effective, reduction in printing costs, versioning is accurate and collaboration is part of the process. Effective practises are maintained and enhanced and can be improved without effecting productivity." ],
          "links" : [ "APST.7.2.4" ]
        },
        "delivering" : {
          "descriptions" : [ "Administrative practices and systems effectively support school operations and teaching." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The school makes informed choices about administrative practices and systems in place, based on cost effectiveness, evidence, and in response to local context and need." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The school evaluates its administrative systems and processes, ensuring that they are delivering anticipated benefits to the school community, and makes changes when required.", "The leadership team collects information about the school’s administrative practices in order to ensure their effectiveness." ],
          "links" : [ ]
        }
      }, {
        "label" : "Service Delivery",
        "links" : [ "C.1.1.2", "C.1.4.1", "C.3.3.2", "C.3.3.3", "C.3.7.1", "C.3.7.2", "C.3.7.3", "C.3.7.4", "C.3.7.5", "C.3.7.6", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "Online ‘Parent Portal’ for all parents and carers, automatically linked to correct students and permissioned dynamically through EBS.", "Parent Portal to enable attendance, reporting, communication with teachers/staff, view assessment and feedback, calendars, homework, permission notes and school fees.", "Online collaboration with community stakeholders, parents and carers to ensure up to date and relevant information is available 24/7 through social media, SWS, and parent portal." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online systems are strategic, easily managed by those in charge of areas / milestones etc. and can respond in real time (or very quickly) due to push/pull notifications and whole school responsibility to quality service delivery.", "Satisfaction gauged through social media and other surveys e.g. TTFM." ],
          "links" : [ "APST.7.2.4", "APST.7.3.4", "APST.7.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "All school staff are supported to develop skills for the successful operation of administrative systems and a positive customer service ethic is evident." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "Streamlined, flexible processes exist to deliver services and information and to support parental engagement and satisfaction." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "Management practices and processes are responsive to school community feedback. There is a whole school approach to improving service delivery and customer (parent and/or student) experience.", "Management practices and processes are responsive to school community feedback. There is a whole school approach to improving service delivery and customer (parent and/or student) experience." ],
          "links" : [ ]
        }
      }, {
        "label" : "Community satisfaction",
        "links" : [ "C.1.4.1", "C.3.3.3", "C.3.3.4", "C.3.7.1", "C.3.7.4", "C.3.7.5", "C.3.7.6", "IMF.8.0", "IMF.14.0" ],
        "dleAspects" : {
          "descriptions" : [ "TTFM parent and student survey to ensure community voice is heard and identified priorities are address in a timely manner.", "Analysis of social media, community surveys and parental communication data to inform best practice and community priorities." ],
          "links" : [ ]
        },
        "dleBenefits" : {
          "descriptions" : [ "Online systems are also linked to social media and satisfaction can be gauged easily through analytics.", "These are consistently monitored and checked by a team of staff to ensure community responses can be dealt with in real time." ],
          "links" : [ "APST.7.2.4", "APST.7.3.4", "APST.7.4.4" ]
        },
        "delivering" : {
          "descriptions" : [ "The leadership team measures school community (parent and student) satisfaction." ],
          "links" : [ ]
        },
        "sustaining" : {
          "descriptions" : [ "The leadership team analyses responses to school community satisfaction measures." ],
          "links" : [ ]
        },
        "excelling" : {
          "descriptions" : [ "The leadership team measures school community (parent and student) satisfaction and shares its analysis and actions in response to the findings with its community." ],
          "links" : [ ]
        }
      }]
    } ]
  } ]
}