{
  "id" : "1628638618481",
  "name" : "music_syllabus",
  "syllabusInformation" : {
    "version" : null,
    "originalPublished" : null,
    "copyright" : null,
    "termOfCondition" : [ ],
    "contact" : [ "Tel: (02) 9367 8111", "Fax: (02) 9367 8484" ],
    "publisher" : [ "Board of Studies NSW", "GPO Box 5300", "Sydney NSW 2001", "Australia" ],
    "websiteUrl" : "www.boardofstudies.nsw.edu.au",
    "ids" : [ ]
  },
  "toc" : {
    "title" : "Contents",
    "tocs" : [ {
      "num" : "1",
      "label" : "Introduction",
      "pageNum" : 5
    }, {
      "num" : "1.1",
      "label" : "The K–10 Curriculum",
      "pageNum" : 5
    }, {
      "num" : "1.2",
      "label" : "Students with Special Education Needs",
      "pageNum" : 6
    }, {
      "num" : "2",
      "label" : "Rationale",
      "pageNum" : 8
    }, {
      "num" : "3",
      "label" : "The Pathway of Learning for Music in the K–12 Curriculum",
      "pageNum" : 9
    }, {
      "num" : "4",
      "label" : "Aim",
      "pageNum" : 10
    }, {
      "num" : "5",
      "label" : "Objectives",
      "pageNum" : 11
    }, {
      "num" : "6",
      "label" : "Outcomes",
      "pageNum" : 12
    }, {
      "num" : "7",
      "label" : "Content",
      "pageNum" : 14
    }, {
      "num" : "7.1",
      "label" : "Organisation of Content",
      "pageNum" : 14
    }, {
      "num" : "7.2",
      "label" : "Content Overview",
      "pageNum" : 16
    }, {
      "num" : "7.3",
      "label" : "Content for Stage 4",
      "pageNum" : 23
    }, {
      "num" : "7.4",
      "label" : "Content for Stage 5",
      "pageNum" : 30
    }, {
      "num" : "8",
      "label" : "Life Skills Outcomes and Content",
      "pageNum" : 40
    }, {
      "num" : "8.1",
      "label" : "Outcomes",
      "pageNum" : 40
    }, {
      "num" : "8.2",
      "label" : "Content",
      "pageNum" : 41
    }, {
      "num" : "9",
      "label" : "Continuum of Learning in Music K–10",
      "pageNum" : 49
    }, {
      "num" : "9.1",
      "label" : "Stage Outcomes",
      "pageNum" : 49
    }, {
      "num" : "9.2",
      "label" : "Stage Statements",
      "pageNum" : 52
    }, {
      "num" : "10",
      "label" : "Assessment",
      "pageNum" : 56
    }, {
      "num" : "10.1",
      "label" : "Standards",
      "pageNum" : 56
    }, {
      "num" : "10.2",
      "label" : "Assessment for Learning",
      "pageNum" : 56
    }, {
      "num" : "10.3",
      "label" : "Reporting",
      "pageNum" : 58
    }, {
      "num" : "10.4",
      "label" : "Choosing Assessment Strategies",
      "pageNum" : 59
    } ]
  },
  "children" : [ {
    "name" : "1 Introduction",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ {
      "name" : "1.1 The K-10 Curriculum",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "This syllabus has been developed within the parameters set by the Board of Studies NSW in its K-10 Curriculum Framework. This framework ensures that K-10 syllabuses and curriculum requirements are designed to provide educational opportunities that:", "<li>engage and challenge all students to maximise their individual talents and capabilities for lifelong learning</li>", "<li>enable all students to develop positive self-concepts and their capacity to establish and maintain safe, healthy and rewarding lives</li>", "<li>prepare all students for effective and responsible participation in their society, taking account of moral, ethical and spiritual considerations</li>", "<li>encourage and enable all students to enjoy learning, and to be self-motivated, reflective, competent learners who will be able to take part in further study, work or training</li>", "<li>promote a fair and just society that values diversity</li>", "<li>promote continuity and coherence of learning, and facilitate the transition between primary and secondary schooling.</li>", "The framework also provides a set of broad learning outcomes that summarise the knowledge, understanding, skills, values and attitudes essential for all students to succeed in and beyond their schooling. These broad learning outcomes indicate that students will:", "<li>understand, develop and communicate ideas and information</li>", "<li>access, analyse, evaluate and use information from a variety of sources</li>", "<li>work collaboratively with others to achieve individual and collective goals</li>", "<li>possess the knowledge and skills necessary to maintain a safe and healthy lifestyle</li>", "<li>understand and appreciate the physical, biological and technological world and make responsible and informed decisions in relation to their world</li>", "<li>understand and appreciate social, cultural, geographical and historical contexts, and participate as active and informed citizens</li>", "<li>express themselves through creative activity and engage with the artistic, cultural and intellectual work of others</li>", "<li>understand and apply a variety of analytical and creative techniques to solve problems</li>", "<li>understand, interpret and apply concepts related to numerical and spatial patterns, structures and relationships</li>", "<li>be productive, creative and confident in the use of technology and understand the impact of technology on society</li>", "<li>understand the work environment and be equipped with the knowledge, understanding and skills to evaluate potential career options and pathways</li>", "<li>develop a system of personal values based on their understanding of moral, ethical and spiritual matters.</li>", "The ways in which learning in the Music Years 7-10 Syllabus contributes to the curriculum and to the student’s achievement of the broad learning outcomes are outlined in the syllabus rationale.", "In accordance with the K-10 Curriculum Framework, the Music Years 7-10 Syllabus takes into account the diverse needs of all students. It identifies essential knowledge, understanding, skills, values and attitudes. It enunciates clear standards of what students are expected to know and be able to do in Years 7-10. It provides structures and processes by which teachers can provide continuity of study for all students, particularly to ensure successful transition through Years 5 to 8 and from Year 10 to Year 11.", "The syllabus also assists students to maximise their achievement in Music through the acquisition of additional knowledge, understanding, skills, values and attitudes. It contains advice to assist teachers to program learning for those students who have gone beyond achieving the outcomes through their study of the essential content." ],
      "children" : [ ]
    }, {
      "name" : "1.2 Students with Special Education Needs",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "In the K-6 curriculum, students with special education needs are provided for in the following ways:", "<li>through the inclusion of outcomes and content in syllabuses which provide for the full range of students</li>", "<li>through the development of additional advice and programming support for teachers to assist students to access the outcomes of the syllabus</li>", "<li>through the development of specific support documents for students with special education needs</li>", "<li>through teachers and parents planning together to ensure that syllabus outcomes and content reflect the learning needs and priorities of students.</li>", "Students with special education needs build on their achievements in K-6 as they progress through their secondary study and undertake courses to meet the requirements for the School Certificate.", "It is necessary to continue focusing on the needs, interests and abilities of each student when planning a program for secondary schooling. The program will comprise the most appropriate combination of courses, outcomes and content available." ],
      "children" : [ {
        "name" : "Life Skills",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "For most students with special education needs, the outcomes and content in sections 6 and 7 of this syllabus will be appropriate but for a small percentage of these students, particularly those with an intellectual disability, it may be determined that these outcomes and content are not appropriate. For these students the Life Skills outcomes and content in section 8 and the Life Skills assessment advice below can provide the basis for developing a relevant and meaningful program." ],
        "children" : [ ]
      }, {
        "name" : "Access to Life Skills outcomes and content in Years 7-10",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "A decision to allow a student to access the Music Years 7-10 Life Skills outcomes and content should include parents/carers and be based on careful consideration of the student’s competencies and learning needs.", "The decision should establish that the outcomes and content in sections 6 and 7 of the Music Years 7-10 Syllabus are not appropriate to meet the needs of the student. Consideration should be given to whether modifications to programs and to teaching, including adjustments to learning activities and assessment, would enable the student to access the syllabus outcomes and content.", "As part of the decision to allow a student to access the Music Years 7-10 Life Skills outcomes and content, it is important to identify relevant settings, strategies and resource requirements that will assist the student in the learning process. Clear time frames and strategies for monitoring progress, relevant to the age of the student, need to be identified and collaborative plans should be made for future needs.", "It is not necessary to seek permission of the Office of the Board of Studies for students to undertake the Music Years 7-10 Life Skills outcomes and content, nor is it necessary to submit planning documentation." ],
        "children" : [ ]
      }, {
        "name" : "Life Skills assessment",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Each student undertaking a Music Years 7-10 Life Skills course will have specified outcomes and content to be studied. The syllabus content listed for each outcome forms the basis of learning opportunities for students.", "Assessment should provide opportunities for students to demonstrate achievement in relation to the outcomes and to generalise their knowledge, understanding and skills across a range of situations or environments including the school and the wider community.", "Students may demonstrate achievement in relation to Music Years 7-10 Life Skills outcomes independently or with support. The type of support will vary according to the particular needs of the student and the requirements of the activity. Examples of support may include:", "<li>the provision of extra time</li>", "<li>physical and/or verbal assistance from others</li>", "<li>the provision of technological aids.</li>" ],
        "children" : [ ]
      } ]
    } ]
  }, {
    "name" : "2 Rationale",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ "All students should have the opportunity to develop their musical abilities and potential. As an artform, music pervades society and occupies a significant place in world cultures and in the oral and recorded history of all civilisations. It uses a unique symbol system that uses sound to imply meaning and convey information, and has the capacity to cross cultural and societal boundaries. Music plays important roles in the social, cultural, aesthetic and spiritual lives of people. At an individual level, music is a medium of personal expression. It enables the sharing of ideas, feelings and experiences.", "The study of music combines the development of affective, cognitive and psychomotor domains in the act of making music. It allows for the expression of emotion and imagination, the intellect and the exploration of values. Music fosters an understanding of continuity and change, and of the connections between different times and cultures. The nature of musical study also allows students to develop their capacity to manage their own learning, engage in problem-solving, work collaboratively and engage in activity that reflects the real world practice of performers, composers and audiences. The study of music fosters knowledge, understanding and skills that contribute to lifelong processes of learning and to the appreciation and enjoyment of music.", "While students will develop knowledge and skills in each of the individual areas of performing, composing and listening, the integration of experiences in these areas enhances the understanding and manipulation of the concepts of music in differing musical contexts.", "The purpose of the Years 7-10 syllabus is to provide students with the opportunity to build on the knowledge, understanding, skills, values and attitudes gained in Stage 3 and encourage the desire to continue learning in formal and informal musical settings beyond Stage 5. Music Years 7-10 provides students with opportunities to extend their musical knowledge and the Music Elective course will serve as a pathway for further formal study in Music 2 in Stage 6.", "The curriculum structure is adaptable enough to meet the needs and abilities of students whose interests range from the broadly based to the pursuit of specialised musical knowledge and skills." ],
    "children" : [ ]
  }, {
    "name" : "3 The Pathway of Learning for Music in the K-12 Curriculum",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ ]
  }, {
    "name" : "4 Aim",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ "The aim of the Music Years 7-10 Syllabus is to provide students with the opportunity to acquire the knowledge, understanding and skills necessary for active engagement and enjoyment in performing, composing and listening, and to allow a range of music to have a continuing role in their lives." ],
    "children" : [ ]
  }, {
    "name" : "5 Objectives",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ ]
  }, {
    "name" : "6 Outcomes",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ ]
  }, {
    "name" : "7 Content",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ {
      "name" : "7.1 Organisation of Content",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "The Music Years 7-10 Syllabus builds on the artform of Music in the Creative Arts K-6 Syllabus (2000) and has the same conceptual base and theoretical underpinnings. It contains both a mandatory and elective course.", "The mandatory course provides a foundation in Music for all students.", "The elective course will build sequentially from the mandatory course and is designed for students in Years 7-10 who wish to extend their musical experiences and learning. The knowledge, understanding and skills gained in the course provide a firm foundation for the study of Music in Stage 6.", "The Mandatory course is based on 100 indicative hours of classroom music. The Elective course can be implemented as either a 100-hour or 200-hour course for the award of a School Certificate.", "In the Music Mandatory and Elective courses, students will study:", "<li>the concepts of music</li>", "<li>through the learning experiences of performing, composing and listening</li>", "<li>within the context of a range of styles, periods and genres.</li>" ],
      "children" : [ {
        "name" : "Concepts of music",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "<li>duration</li>", "<li>pitch</li>", "<li>dynamics and expressive techniques</li>", "<li>tone colour</li>", "<li>texture</li>", "<li>structure</li>" ],
        "children" : [ ]
      }, {
        "name" : "Learning experiences",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "<li>performing</li>", "<li>composing</li>", "<li>listening</li>" ],
        "children" : [ ]
      }, {
        "name" : "Contexts",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "The mandatory course requires students to study a broad range of contexts, including art music.", "The elective course requires students to study one compulsory topic - Australian Music - as well as a number of other topics from two defined groups that aim to provide depth and breadth of musical study." ],
        "children" : [ ]
      }, {
        "name" : "Essential content",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "In the mandatory course, essential content refers to students engaging in the concepts of music, learning experiences and various contexts. Students are to be exposed to a broad range of repertoire. This must include an exposure to art music as well as a range of music that reflects the diversity of Australian culture.", "In the elective course, essential content refers to students engaging in the concepts of music, learning experiences and various contexts. Students must also study a compulsory topic - Australian Music - as well as a number of additional topics depending on the pattern of implementation chosen." ],
        "children" : [ ]
      }, {
        "name" : "Additional content",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "In the mandatory course, additional content refers to students engaging in the concepts of music, learning experiences and various contexts and can be approached through the study of additional contexts. However, teachers will routinely make decisions about the complexity of the repertoire used for study that will assist them in broadening, deepening and extending student learning within this course.", "In the elective course, additional content refers to students engaging in the concepts of music, learning experiences and various contexts. The syllabus describes implementation patterns for 100-hour study and 200-hour study. Schools that choose to offer additional hours beyond 200 hours can engage in further topics or may develop topics of their own." ],
        "children" : [ ]
      }, {
        "name" : "Life Skills",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Life Skills outcomes and content are in section 8 of the syllabus." ],
        "children" : [ ]
      } ]
    }, {
      "name" : "7.2 Content Overview",
      "style" : "LevelB",
      "type" : null,
      "description" : [ ],
      "children" : [ {
        "name" : "The concepts of music",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Duration",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Duration refers to the lengths of sounds and silences in music and includes the aspects of beat, rhythm, metre, tempo, pulse rates and absence of pulse.", "Students should be able to manipulate and discuss the following aspects of duration as relevant to the music studied:", "<li>beat: the underlying pulse in music</li>", "<li>metre: the groupings of beats</li>", "<li>tempo: the speed of the beat. Music may be relatively fast or slow and may become faster or slower</li>", "<li>rhythm: patterns of long and short sounds and silences found in music.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Pitch",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Pitch refers to the relative highness and lowness of sounds. Important aspects include high, low, higher and lower pitches, direction of pitch movement, melody, harmony, indefinite and definite pitch.", "Students should be able to manipulate and discuss the following aspects of pitch as relevant to the music studied:", "<li>high/low: pitches can be comparatively high or low</li>", "<li>indefinite pitch: non-melodic sounds, for example, the speaking voice</li>", "<li>definite pitch: melodic sounds, for example, the singing voice</li>", "<li>direction of pitch movement: up, down, same level</li>", "<li>melody: a succession of pitches</li>", "<li>harmony: two or more pitches sounding together</li>", "<li>tonality: the effect created by the observance of a particular scale pattern.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Dynamics and expressive techniques",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Dynamics refer to the volume of sound. Important aspects include the relative softness and loudness of sound, change of loudness (contrast), and the emphasis on individual sounds (accent).", "Expressive techniques refer to the musical detail that articulates a style or interpretation of a style.", "Students should be able to manipulate and discuss the following aspects of dynamics and expressive techniques as relevant to the music studied:", "<li>a range of dynamics, including gradations</li>", "<li>articulations</li>", "<li>gradations of tempo used for expressive effect, for example, rubato</li>", "<li>stylistic indications.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Tone colour",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "<li>sound source material, for example, wood, metal, string, skin, electronic and vocal</li>", "<li>combination of sound sources, for example, single voice, multiple voices, voices accompanied or unaccompanied by instruments</li>", "<li>method of sound production, for example, blowing, hitting, plucking, scraping and shaking.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Texture",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Texture results from the way voices and/or instruments are combined in music.", "Students should be able to manipulate and discuss the following aspects of texture as relevant to the music studied:", "<li>the layers of sound and their function</li>", "<li>the roles of instruments and/or voices.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Structure",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Structure refers to the idea of design or form in music. In organising sound the concepts of duration, dynamics, pitch and tone colour are combined in some way for a particular purpose. Structure relates to the ways in which music sounds the same (or similar) and/or different.", "Students should be able to manipulate and discuss the following aspects of structure as relevant to the music studied:", "<li>phrases</li>", "<li>motifs</li>", "<li>repetitive patterns (eg riffs, ostinati, ground bass)</li>", "<li>techniques of call and response/question and answer</li>", "<li>traditional and non-traditional patterns of musical structure</li>", "<li>structures used in single pieces of music (eg song form, da capo aria)</li>", "<li>multi-movement structures (eg symphony).</li>" ],
      "children" : [ {
        "name" : "Learning experiences",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "In designing teaching programs, teachers should provide a program that balances work in each of the learning experiences. Learning in music occurs best when these experiences are integrated with each other.", "In selecting repertoire for performing, composing and listening, teachers should provide a balance, where possible, of female and male composers and performers. They should also explore the key roles that performers, composers, critics and others play in the music industry." ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Performing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Performing refers to participating in any form of practical music making in solo and/or ensemble situations. The development of performance skills should be fostered by providing performance opportunities in a variety of media, styles and genres according to individual needs, interests, abilities and school resources." ],
      "children" : [ ]
    }, {
      "name" : "Composing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Composing refers to organising sound. The development of skills in composing results from continued involvement in a wide range of experiences in classroom activities. This should include both individual and group work. Activities can range from the simple to the complex and at times may involve relatively small tasks that can be synthesised into more complete pieces of music." ],
      "children" : [ ]
    }, {
      "name" : "Listening",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Listening refers to the ability to hear, understand and respond to a wide range of musical styles, periods and genres. Listening involves the ability to discriminate between sounds and to make judgements about their use in a range of repertoire. In Music Years 7-10, listening also involves studying sound in relation to musical scores to understand how composers have used and manipulated the concepts of music in their works." ],
      "children" : [ {
        "name" : "Contexts",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students study music from a variety of contexts. These contexts (styles, periods and genres) are usually studied through specific topics. However, teachers of the mandatory course may use alternative methods from the study of topics. Both the mandatory and elective courses have specific requirements regarding contexts." ],
        "children" : [ ]
      }, {
        "name" : "Technology in music",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Any instrument can be regarded as a piece of technology — a tool that can be used by a musician to make music. Technological development has always been a feature of music. \nFor example, the improved construction of the piano in the eighteenth century and \nthe incorporation of valves into brass instruments in the nineteenth century had a \nsignificant impact on the way these instruments were used and the music that was \ncomposed for them.", "Musicians are avid consumers of new technologies. Advances during the twentieth and twenty-first centuries have influenced and will continue to influence the ways in which musicians work, both in terms of the instruments they play and the means by which they record and share their performances.", "Ongoing developments in analog and digital electronics have meant that musicians have access to a wide range of new instruments and sounds as well as the means to record and manipulate sounds. Synthesisers, sequencers, non-linear recording and editing systems are everyday tools of many musicians.", "Teachers are encouraged to use the full range of technologies available to them, in the classroom and in the wider school context. For further details refer to the Information and Communication Technologies cross-curriculum content." ],
        "children" : [ ]
      }, {
        "name" : "Improvisation in Music Years 7-10",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Improvisation is the simultaneous creation and performance of music. It has an important function as a tool for developing knowledge, understanding and skills in a variety of aspects of music. The improviser draws on known information and seeks to re-order it to produce something different.", "There are many types of improvisation. The role it plays varies in different genres, periods and styles of music. For example, improvisation or extemporisation in baroque music is an important stylistic feature for study.  Additionally, the performance of most contemporary popular music involves improvisation. It may occur in one section of a piece of music or may be the form of production of the entire piece, particularly in jazz.", "Teachers are encouraged to include improvisation as an integral part of teaching programs. Working with improvisation can begin at very basic levels of experimenting with sounds within set parameters to complex improvisations.  Teachers should consider the musical development of the students and encourage the skill of improvisation at every level." ],
        "children" : [ ]
      }, {
        "name" : "Cross-curriculum content",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Cross-curriculum content assists students to achieve the broad learning outcomes defined in the Board of Studies K-10 Curriculum Framework. It is incorporated in the content of the Music Years 7-10 Syllabus in the following ways:" ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Information and Communication Technologies (ICT)",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "<li>simulation/modelling using computer-based notational and performance software that is integrated into the learning experiences of performing, composing and listening.</li>", "The range of technologies available to them may include:", "<li>a variety of computer hardware and software which can be used to teach a range of theoretical, aural and compositional skills</li>", "<li>the internet as a tool for research and learning</li>", "<li>computers and digital instruments that can be linked by MIDI (Musical Instrument Digital Interface) and programs for composing, performing, notating and reproducing music</li>", "<li>file transfer systems, such as MIDI files and MP3s, that can be used to share musical ideas between members of a class, between students and teachers, or across the internet</li>", "<li>non-linear recording and editing systems that allow for the recording and transformation of musical performances.</li>", "Throughout the mandatory and elective courses students should, where appropriate, use the following ICT applications:", "<li>word processing to assist in the preparation of reports and reviews that reflect the nature of study in Music</li>", "<li>multimedia to create presentations that include graphic and auditory components</li>", "<li>creation of digitally generated and manipulated music</li>", "<li>graphics-based programs to create non-traditional notation</li>", "<li>electronic communication for research. This may include information about composers, performing groups, music in other cultures, and recordings, as well as access to MIDI files.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Work, Employment and Enterprise",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Students in the mandatory and elective courses will develop an understanding of the role of performers, composers, and critics/writers, as well as other key roles in the music industry. Composition and performance encourage students to work innovatively and creatively with available resources in real world situations. The listening component of the syllabus develops students’ critical ear. It contributes to the way that students evaluate, synthesise and analyse musical works. As students develop their knowledge, understanding and skills in performing, composing and listening, they should be made aware of the opportunities that these skills can offer them in the world of work." ],
      "children" : [ ]
    }, {
      "name" : "Aboriginal and Indigenous",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Teachers in the mandatory and elective courses will embed aspects of Aboriginal and Indigenous cross-curriculum content in the content of Music, especially in the study of contexts throughout Years 7-10. Content should allow students to develop an understanding of the importance of language and the arts for maintaining culture, and to become aware of the links between cultural expression and spirituality. Students should be encouraged to study music within its cultural context and recognise the coexistence of both traditional and contemporary Aboriginal and Indigenous music." ],
      "children" : [ ]
    }, {
      "name" : "Civics and Citizenship",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Students in the mandatory and elective courses will be given the opportunity to investigate the cultural heritage of music in this country through topics such as Australian Music. They will explore the work of particular Australian composers and performers who have contributed to the artistic life of the country. This could also be achieved through an examination of the growth and development of Australian composition in the twentieth and twenty-first centuries." ],
      "children" : [ ]
    }, {
      "name" : "Environment",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In the mandatory and elective courses the notion of interactions between the natural and built environments can be achieved through the realisation that music performances exist beyond a concert hall environment. Teachers may choose to focus on various composers and performers who explore the possibilities of music by creating soundscapes for natural and built environments around Australia and overseas. Teachers may also focus on the representation of the environment in composers’ music in a range of styles, periods and genres." ],
      "children" : [ ]
    }, {
      "name" : "Gender",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Students in the mandatory and elective courses will focus on the musical achievements of female and male composers, performers and researchers. Teachers should explore the contribution of significant women in the male-dominated fields of composition, performing and conducting. Teachers should also be mindful of gender associations with particular instruments and ensure that all students have equal encouragement and access to the range of instruments available." ],
      "children" : [ ]
    }, {
      "name" : "Key Competencies",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In the mandatory and elective courses content will provide scope within the content for students to explore the key competencies. Key competencies are embedded in the Music curriculum to enhance student learning. The key competencies of collecting, analysing and organising information, communicating ideas and information, and planning and organising activities are integral to the nature of music education. Students work as individuals and in ensembles in classroom activities, and through this the key competency of working with others and in teams is addressed. The nature of music requires students to consistently engage in problem-solving activities, thus addressing the key competency of problem-solving. Patterning, sequencing and the mathematical principles involving shape, volume, density and repetition are an essential component of aural skills and musical composition and align with the key competency of using mathematical ideas and techniques. Throughout the study of music, students incorporate technological perspectives into their work, which addresses the key competency of using technology." ],
      "children" : [ ]
    }, {
      "name" : "Literacy",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In the mandatory and elective courses students will explore literacy by describing, classifying and interpreting meaning from a range of sources, including textual, sound, graphic and multimedia sources. They learn to critically evaluate information and prepare work for different audiences (eg a written report and a review of a performance). Students will become familiar with and use an increasing music vocabulary in both oral and written forms and will also develop significant skills in music literacy as a result of their engagement with this syllabus, which prepares them for the requirements of Music 2 in Stage 6." ],
      "children" : [ ]
    }, {
      "name" : "Multicultural",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In the mandatory and elective courses students will be provided with opportunities to develop understanding and appreciation of a variety of cultural contexts. This could include the study of music of other cultures, folk music and world music as well as the diversity of music within Australia. Content should allow students to develop an understanding of the importance of the arts for maintaining culture and as a means of cultural expression." ],
      "children" : [ ]
    }, {
      "name" : "Numeracy",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In the mandatory and elective courses the development of numeracy skills will be evident in students developing an understanding of traditional notation, a symbol system that relies on developing an understanding of patterns and fractions. The development of skills in traditional notation are evident in Music content.", "Across the Years 7-10 curriculum there are other areas of cross-curriculum content that all students will experience through the mandatory curriculum. The additional area of cross-curriculum content is Difference and Diversity." ],
      "children" : [ ]
    }, {
      "name" : "7.3 Content for Stage 4",
      "style" : "LevelB",
      "type" : null,
      "description" : [ ],
      "children" : [ {
        "name" : "Performing - Mandatory Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Students will develop knowledge, understanding and skills in the musical concepts through performing as a means of self-expression, interpreting musical symbols and developing solo and/or ensemble techniques.",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 26-29." ],
        "children" : [ ]
      }, {
        "name" : "Composing - Mandatory Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through composing as a means of self-expression, musical creation and problem-solving.", "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 26-29." ],
        "children" : [ ]
      }, {
        "name" : "Listening - Mandatory Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through listening as a means of extending aural awareness and communicating ideas about music in social, cultural and historical contexts.", "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 26-29." ],
        "children" : [ ]
      }, {
        "name" : "Life Skills",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "For some students with special education needs, particularly those students with an intellectual disability, it may be determined that the above content is not appropriate. For these students, Life Skills outcomes and content can provide the basis for the development of a relevant and meaningful program - see section 8." ],
        "children" : [ ]
      }, {
        "name" : "The concepts of music in the mandatory course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Duration",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the mandatory course should demonstrate:", "<li>a steady beat at various tempi</li>", "<li>a changing beat at various tempi</li>", "<li>duple, triple and quadruple time signatures</li>", "<li>metric groupings of two and three notes and rests in simple and compound time.</li>", "Throughout the mandatory course, students should have experience in using the following notation:", "<li>rhythmic devices such as syncopation.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Pitch",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the mandatory course should demonstrate:", "<li>high and low</li>", "<li>definite and indefinite pitch</li>", "<li>pitch direction and contour</li>", "<li>steps, leaps and repeated notes</li>", "<li>simple melodies and melodic patterns, particularly in pentatonic, modal and major tonality</li>", "<li>simple accompaniments, particularly in pentatonic and major tonality</li>", "<li>combination of pitches</li>", "<li>chords, particularly I, IV, V and V7</li>", "<li>methods of notating pitch, both traditional and non-traditional</li>", "<li>treble and bass clefs.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Dynamics and expressive techniques",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the mandatory course should demonstrate:", "<li>a range of dynamics, including dynamic gradations</li>", "<li>articulations (eg legato, staccato)</li>", "<li>a range of tempi, including tempo gradations</li>", "<li>musical directions as appropriate to the repertoire studied.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Tone colour",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the mandatory course should demonstrate:", "<li>the use of voices</li>", "<li>the use of instruments</li>", "<li>combinations of instruments and voices</li>", "<li>a variety of sound production methods (eg scraping, plucking, shaking, blowing etc)</li>", "<li>a variety of sound source materials, including electronic and computer-generated sounds.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Texture",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "<li>the use of layers of sound</li>", "<li>the roles of instruments and voices (eg melody and accompaniment).</li>" ],
      "children" : [ ]
    }, {
      "name" : "Structure",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the mandatory course should demonstrate:", "<li>phrases</li>", "<li>motifs</li>", "<li>themes</li>", "<li>repetition and contrast</li>", "<li>riffs</li>", "<li>ostinati</li>", "<li>question and answer, call and response</li>", "<li>sequences</li>", "<li>simple structures as appropriate to the repertoire studied (eg binary, ternary, verse, chorus etc)</li>", "<li>introduction and coda.</li>" ],
      "children" : [ {
        "name" : "The learning experiences in the mandatory course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Performing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the mandatory course will have experiences in:", "<li>singing</li>", "<li>playing instruments and other sound sources both melodic and non-melodic</li>", "<li>moving to a musical stimulus</li>", "<li>improvising</li>", "<li>accompanying</li>", "<li>interpreting different forms of notation</li>", "<li>using different types of technology for performance.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Composing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the mandatory course will have experiences in:", "<li>exploring, experimenting, improvising, organising, arranging and composing using a variety of sound sources and movement activities</li>", "<li>experimenting with computer-based technologies to create compositions</li>", "<li>notating compositions using non-traditional notation, which may be self-devised</li>", "<li>notating compositions using traditional notation.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Listening",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the mandatory course will have experiences in:", "<li>listening, observing, discussing and responding in oral and written form to a range of repertoire</li>", "<li>listening, observing, discussing and responding in oral and written form to how composers have used the concepts of music in their works</li>", "<li>reading and interpreting simple musical scores</li>", "<li>identifying and investigating the role technology has played in music throughout the ages.</li>" ],
      "children" : [ {
        "name" : "Contexts in the mandatory course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "The emphasis in the mandatory course is on students gaining a general experience in the study of music. The repertoire used with students must be varied and reflect students’ needs, experiences, expectations, backgrounds and levels of musical development. This repertoire must be designed to extend and enrich students’ musical experiences. The study of a range of musical contexts will provide a strong foundation for further musical development in the Music elective course.", "Musical study in the mandatory course must emphasise a range of repertoire that allows students to explore and experience the concepts of music in a broad range of contexts. This must include an exposure to art music as well as a range of music that reflects the diversity of Australian culture, including music of Aboriginal and Torres Strait Islander peoples. Teachers must be sure to present this music within a cultural context and be observant of the appropriateness of presenting such materials.", "Strategies for developing teaching and learning programs may include a combination of the following approaches:", "<li>a concept-based approach across a range of repertoire</li>", "<li>a skill-based approach across a range of repertoire</li>", "<li>a topic-based approach.</li>", "Topics may include the following, plus others devised by teachers:", "<li>art music of various styles, periods, genres and cultures</li>", "<li>jazz</li>", "<li>popular music</li>", "<li>music for radio, film, television and multimedia</li>", "<li>theatre music</li>", "<li>environmental music</li>", "<li>music of a culture.</li>" ],
        "children" : [ ]
      } ]
    }, {
      "name" : "7.4 Content for Stage 5",
      "style" : "LevelB",
      "type" : null,
      "description" : [ ],
      "children" : [ {
        "name" : "Performing - Elective Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through performing as a means of self-expression, interpreting musical symbols and developing solo and/or ensemble techniques.", "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 33-39." ],
        "children" : [ ]
      }, {
        "name" : "Composing - Elective Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Students will develop knowledge, understanding and skills in the musical concepts through composing as a means of self-expression, musical creation and problem-solving.",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 33-39." ],
        "children" : [ ]
      }, {
        "name" : "Listening - Elective Course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through listening as a means of extending aural awareness and communicating ideas about music in social, cultural and historical contexts.", "Teachers should also refer to the detailed information on the concepts of music, learning experiences and contexts provided on pages 33-39." ],
        "children" : [ ]
      }, {
        "name" : "The concepts of music in the elective course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Duration",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>mixed metre</li>", "<li>uneven metric groupings of two, three and four in simple and compound time</li>", "<li>more complex rhythmic patterns including rhythmic devices such as triplets and duplets and unusual rhythmic groupings. Throughout the elective course students should have experiences that build on the notation used in the mandatory course and include the following notation:</li>", "<li>ties</li>", "<li>syncopation</li>", "<li>anacrusis.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Pitch",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>simple melodies in pentatonic, modal, major and minor tonality</li>", "<li>simple accompaniments using pentatonic scales and diatonic chords characteristic of the repertoire being studied</li>", "<li>perfect, plagal, imperfect and interrupted cadences</li>", "<li>chromaticism</li>", "<li>modulation</li>", "<li>alto and tenor clefs</li>", "<li>pitch conventions used in music of other cultures.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Dynamics and expressive techniques",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>a range of dynamics, including dynamic gradations</li>", "<li>articulation</li>", "<li>a range of tempi, including tempo gradations</li>", "<li>phrasing</li>", "<li>ornamentation</li>", "<li>stylistic indications as they relate to the repertoire studied.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Tone colour",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>the use of voices and various combinations of voices</li>", "<li>the use of instruments and various combinations of instruments</li>", "<li>various combinations of instruments and voices</li>", "<li>techniques to manipulate tone colour</li>", "<li>acoustic, electronic and synthesised sounds</li>", "<li>commonly used directions indicating vocal and instrumental techniques.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Texture",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>the roles of instruments and voices</li>", "<li>the use of layers of sound and their function</li>", "<li>the interaction of the layers of sound and commonly used terms to describe texture.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Structure",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "Repertoire chosen for performing, composing and listening activities in the elective course should demonstrate:", "<li>ways of organising thematic materials</li>", "<li>structures as appropriate to the repertoire studied (eg rondo form, theme and variations, sonata form, strophic form etc)</li>", "<li>multi-movement structures as appropriate to the topics studied (eg concerto, sonata, oratorio etc)</li>", "<li>structures that do not conform to the standard patterns</li>", "<li>ways of structuring music in contemporary contexts.</li>" ],
      "children" : [ {
        "name" : "The learning experiences in the elective course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      } ]
    }, {
      "name" : "Performing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the elective course will have experiences in:", "<li>performing a range of repertoire</li>", "<li>performing student compositions</li>", "<li>performing repertoire characteristic of the compulsory and additional topics studied</li>", "<li>improvising</li>", "<li>discovering the capabilities and ranges of various instruments and voices</li>", "<li>accompanying</li>", "<li>interpreting a variety of musical notation styles</li>", "<li>using different types of technology for performance</li>", "<li>performance presentation.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Composing",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the elective course will have experiences in:", "<li>improvising, arranging and composing using a variety of sound sources and movement activities</li>", "<li>using computer-based and other technologies to create and notate compositions</li>", "<li>notating compositions using notation appropriate to the music selected for study \n(eg traditional notation, guitar tablature, percussion notation, neumes)</li>", "<li>developing a portfolio of compositions and compositional work.</li>" ],
      "children" : [ ]
    }, {
      "name" : "Listening",
      "style" : "LevelB-",
      "type" : null,
      "description" : [ "In particular, students in the elective course will have experiences in:", "<li>analysing, discussing and responding in oral and written form to a range of repertoire</li>", "<li>analysing, discussing and responding in oral and written form to how composers have used the concepts of music in their works</li>", "<li>reading and interpreting musical scores</li>", "<li>developing aural discrimination skills in pitch and rhythm</li>", "<li>sightsinging</li>", "<li>analysing the role technology has played in music throughout the ages.</li>" ],
      "children" : [ {
        "name" : "Contexts in the elective course",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "In the Music elective course, students are required to develop further knowledge, understanding and skills in a range of musical contexts through the study of a compulsory topic and additional topics.", "Students undertaking a 100-hour course in Music must study the compulsory topic, Australian Music, and at least one topic from each of the groups of topics below.", "Students undertaking a 200-hour course in Music must study the compulsory topic, Australian Music, and at least two topics from each of the groups of topics below.", "Schools which choose to offer courses beyond 200 hours must ensure that students have fulfilled the requirements of a 200-hour course. They may then approach further topics from either group or devise further topics of their own.", "Refer to suggested aspects of study on the following pages." ],
        "children" : [ ]
      } ]
    } ]
  }, {
    "name" : "8 Life Skills Outcomes and Content",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ "The Board of Studies recognises that a small percentage of students with special education needs may best fulfil the mandatory curriculum requirements for Music by undertaking Life Skills outcomes and content. (Requirements for access to Life Skills outcomes and content are detailed in section 1.2.)", "Life Skills outcomes will be selected on the basis that they meet the particular needs, goals and priorities of each student. Students are not required to complete all outcomes. Outcomes may be demonstrated independently or with support.", "In order to provide a relevant and meaningful program of study that reflects the needs, interests and abilities of each student, schools may integrate Music Life Skills outcomes and content across a variety of school and community contexts." ],
    "children" : [ {
      "name" : "8.1 Outcomes",
      "style" : "LevelB",
      "type" : null,
      "description" : [ ],
      "children" : [ ]
    }, {
      "name" : "8.2 Content",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "The content forms the basis for learning opportunities. Content will be selected on the basis that it meets the needs, goals and priorities of each student. Students are not required to complete all of the content to demonstrate achievement of an outcome.", "The examples provided are suggestions only." ],
      "children" : [ {
        "name" : "Performing",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through performing as a means of self-expression, interpreting musical symbols and developing solo and/or ensemble techniques." ],
        "children" : [ ]
      }, {
        "name" : "Composing",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through composing as a means of self-expression, musical creation and problem-solving." ],
        "children" : [ ]
      }, {
        "name" : "Listening",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ ],
        "children" : [ ]
      }, {
        "name" : "Objective",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students will develop knowledge, understanding and skills in the musical concepts through listening as a means of extending aural awareness and communicating ideas about music in social, cultural and historical contexts." ],
        "children" : [ ]
      } ]
    } ]
  }, {
    "name" : "9 Continuum of Learning in Music K-10",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ "Stage outcomes and stage statements illustrate the continuum of learning in the Music Years 7-10 Syllabus." ],
    "children" : [ {
      "name" : "9.1 Stage Outcomes",
      "style" : "LevelB",
      "type" : null,
      "description" : [ ],
      "children" : [ ]
    }, {
      "name" : "9.2 Stage Statements",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "Stage statements are summaries of the knowledge, understanding, skills, values and attitudes that have been developed by students as a consequence of achieving the outcomes for the relevant stage of learning." ],
      "children" : [ {
        "name" : "Early Stage 1",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Early Stage 1 in Music have performed music, organised sounds into basic structures, and listened to music, guided by the teacher’s instruction. Students are engaged in music through the use of known songs, rhymes, accompaniments as well as other musical repertoire presented to them.", "They are generally able to identify simple but important features of the music, eg students may recognise that a piece is ‘loud’ or ‘fast’ but may not necessarily be able to discriminate exactly what gives the piece of music these properties. Engaging in these learning experiences allows students to develop important musical skills, eg maintaining a beat, recognising changes in the music, as well as a range of both fine and gross motor facilities.", "Students may begin to understand parts of music through simple symbolic representations, eg by drawing a picture of the sounds they hear, or by responding to simple teacher-devised graphic notation. Students often understand musical activities as simply singing, moving or making sounds without making a connection to music in a broader sense, or to music as an artform. They have limited understanding of how music plays a part in the world.", "Students usually see music as an activity that is engaged in for the purpose of fun and may not recognise its purpose as an artform. They often see music as something that is just heard on the radio, CD or television without necessarily understanding the function that music plays in different forums." ],
        "children" : [ ]
      }, {
        "name" : "Stage 1",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Stage 1 Music have, through teacher guidance, performed through music learning experiences, demonstrating a greater awareness of their own capabilities in using their voice and various sound sources to make music.", "Students are able to organise sounds into simple structures, and as a result of their exploration of musical concepts are able to make simple judgements about musical effectiveness and musical preference. Their listening is more discriminatory and students are able to provide some reasoning for their judgements, eg ‘I like it because it is loud and exciting’.", "At the completion of Stage 1, students are generally able to begin representing their work by using a symbol system, such as a devised form of graphic notation and simple traditional representations of rhythm and pitch. This symbol system is more integrated into their understanding of the process of organising sound. Engaging in these learning experiences continues to develop important musical skills, eg maintaining a beat, recognising sectional changes and discriminating pitch.", "Students are able to distinguish the differences between performing music and making music. They recognise the different roles that musicians have. Students have begun to explore how the world is represented in their learning experiences, eg by producing environmental soundscapes. They recognise that the learning experiences in which they participate in class are part of making music and they understand that music is used differently in various situations. Students understand that people appreciate various forms of music apart from that to which they are exposed through popular media." ],
        "children" : [ ]
      }, {
        "name" : "Stage 2",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Stage 2 in Music, through teacher guidance, recognise that their learning experiences relate to the study of music rather than merely participation in musical activities. They understand that they can have dual roles as both performers and composers and can easily distinguish between these roles.", "Students tend to engage more in the making of music with an increased understanding of the musical concepts and are able to discriminate differences in music, using terms and symbols appropriate to describe these differences. Students at this level make simple but informed judgements about music that tend to be grounded in their own experiences. They begin to speculate more about music and the possibilities that could arise from further manipulation of the music they experience. Their understanding of music has begun to be less concrete and they are able to represent their thoughts and musical ideas through using notational systems beyond and including graphic notation.", "Students’ skills in music allow them to contribute effectively to class and individual music making. They have begun to understand the importance that music has in people’s lives and how different peoples and composers have represented the world in different ways. They have an understanding that music is an artform enjoyed by many and that each experience in music allows them to understand music more.", "Students have begun to understand their roles as listeners and audience members. They make simple but informed decisions about musical preference." ],
        "children" : [ ]
      }, {
        "name" : "Stage 3",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Stage 3 in Music, through teacher guidance, have begun to understand music as an important medium of expression that can be shared both as groups and individually. They understand the roles of performer and composer and how these roles can be both separated and combined. Students recognise that their work in class as both performers and composers can also be combined.", "Students engage in musical learning experiences with an understanding of the musical concepts that allows them to work with the building blocks of music to create compositions and performances that demonstrate their musical understanding. Students are able to work independently to create music that is varied and representative of their study and are able to effectively communicate their ideas through music and about music. They are able to use notation as an effective tool for recording and communicating their ideas in the process of organising sounds.", "Students understand music is an artform appreciated throughout the world in different ways. They recognise ways in which some composers have captured the world in their music, and may be aware how culture has also influenced music. Students are discriminatory in their exploration of sound and are able to objectively discuss their own work and the work of others. They begin to interpret music presented to them through their understanding of factors such as musical concepts.", "Students are able to listen to a variety of both familiar and unfamiliar music with a sense of understanding and appreciation." ],
        "children" : [ ]
      }, {
        "name" : "Stage 4",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Stage 4 in Music have an understanding of a variety of musical styles, periods and genres. They participate in musical activities individually and in groups and have an understanding of the role that music plays in people’s lives.", "Students engage in a range of musical experiences, developing an understanding of the concepts of music as the basis of musical knowledge. They are able to recognise how musical concepts are used, manipulated and recorded in a variety of ways through experiences in performing, composing and listening and the exploration of musical notation.", "Students perform a broad range of repertoire in classroom settings. This repertoire reflects their developing understanding and appreciation of music of different styles, periods and genres. They are capable of performing music in group situations and have experiences of performing individually their own works and the works of others.", "Students experiment, improvise and organise their musical ideas into musical works. They experiment further with the concepts of music and become increasingly able to manipulate these concepts through aspects such as note and rest values, rhythms, textures, structures, pitches, harmonies, dynamics, expressive techniques and tone colours. Students learn to make musically discriminating choices to form compositions. They notate their work using a variety of notational schemes, both traditional and non-traditional.", "Students listen and aurally observe with increased discrimination and understanding. They are aware of how composers have used and manipulated the concepts of music within their works. Students begin to aurally analyse and interpret music from a range of styles, periods and genres and make informed decisions and choices regarding these." ],
        "children" : [ ]
      }, {
        "name" : "Stage 5",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Students who have achieved Stage 5 in Music have an understanding of music as an artform through engagement in performing, composing and listening across a range of styles, periods and genres. They have an understanding of the role music and musical preference plays in their own life and the lives of others.", "Students engage in a range of increasingly sophisticated musical experiences, developing an understanding of the concepts of music and how composers have worked with these concepts within a broad range of styles, periods and genres.", "Students perform a range of repertoire characteristic of the topics they have studied. They engage in group music-making and are increasingly able to perform repertoire as a solo performer, or take solo roles within group performances.", "Students explore, improvise, and construct musical compositions. They are able to explore the capabilities of instruments and how musical concepts can be manipulated for various effects. They notate their own work, choosing notational forms and conventions appropriate to the style, period or genre being explored.", "Students aurally analyse and evaluate the repertoire studied. They engage in discussion of style and interpretation, with an awareness of the social, cultural and historical contexts of the music studied. Students begin to explore music through a range of listening and score-reading activities with an awareness of stylistic forms, structures and conventions." ],
        "children" : [ ]
      } ]
    } ]
  }, {
    "name" : "10 Assessment",
    "style" : "LevelA0",
    "type" : null,
    "description" : [ ],
    "children" : [ {
      "name" : "10.1 Standards",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "The Board of Studies K-10 Curriculum Framework is a standards-referenced framework that describes, through syllabuses and other documents, the expected learning outcomes for students.", "Standards in the framework consist of two interrelated elements:", "<li>outcomes and content in syllabuses showing what is to be learnt</li>", "<li>descriptions of levels of achievement of that learning.</li>", "Exemplar tasks and student work samples help to elaborate standards.", "Syllabus outcomes in Music contribute to a developmental sequence in which students are challenged to acquire new knowledge, understanding and skills.", "The standards are typically written for two years of schooling and set high, but realistic, expectations of the quality of learning to be achieved by the end of Years 2, 4, 6, 8, 10", "and 12." ],
      "children" : [ {
        "name" : "Using standards to improve learning",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Teachers will be able to use standards in Music as a reference point for planning teaching and learning programs, and for assessing and reporting student progress. Standards in Music will help teachers and students to set targets, monitor achievement, and, as a result, make changes to programs and strategies to support and improve each student’s progress." ],
        "children" : [ ]
      } ]
    }, {
      "name" : "10.2 Assessment for Learning",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "Assessment for learning in Music is designed to enhance teaching and improve learning. It is assessment that gives students opportunities to produce the work that leads to development of their knowledge, understanding and skills. Assessment for learning involves teachers in deciding how and when to assess student achievement, as they plan the work students will do, using a range of appropriate assessment strategies including self-assessment and peer assessment.", "Teachers of Music will provide students with opportunities in the context of everyday classroom activities, as well as planned assessment events, to demonstrate their learning.", "In summary, assessment for learning:", "<li>is an essential and integrated part of teaching and learning</li>", "<li>reflects a belief that all students can improve</li>", "<li>involves setting learning goals with students</li>", "<li>helps students know and recognise the standards they are aiming for</li>", "<li>involves students in self-assessment and peer assessment</li>", "<li>provides feedback that helps students understand the next steps in learning and plan how to achieve them</li>", "<li>involves teachers, students and parents in reflecting on assessment data.</li>" ],
      "children" : [ {
        "name" : "Quality Assessment Practices",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "The following Assessment for Learning Principles provide the criteria for judging the quality of assessment materials and practices." ],
        "children" : [ ]
      }, {
        "name" : "Assessment for learning:",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "<b>emphasises the interactions between learning and manageable assessment strategies that promote learning</b>", "In practice, this means:", "- teachers reflect on the purposes of assessment and on their assessment strategies", "- assessment activities allow for demonstration of learning outcomes", "- assessment is embedded in learning activities and informs the planning of future learning activities", "- teachers use assessment to identify what a student can already do.", "<b>clearly expresses for the student and teacher the goals of the learning activity</b>", "In practice, this means:", "- students understand the learning goals and the criteria that will be applied to judge the quality of their achievement", "- students receive feedback that helps them make further progress.", "<b>reflects a view of learning in which assessment helps students learn better, rather than just achieve a better mark</b>", "In practice, this means:", "- teachers use tasks that assess, and therefore encourage, deeper learning", "- feedback is given in a way that motivates the learner and helps students to understand that mistakes are a part of learning and can lead to improvement", "- assessment is an integral component of the teaching-learning process rather than being a separate activity.", "<b>provides ways for students to use feedback from assessment</b>", "In practice, this means:", "- feedback is directed to the achievement of standards and away from comparisons with peers", "- feedback is clear and constructive about strengths and weaknesses", "- feedback is individualised and linked to opportunities for improvement.", "<b>helps students take responsibility for their own learning</b>", "In practice, this means:", "- assessment includes strategies for self-assessment and peer assessment emphasising the next steps needed for further learning.", "<b>is inclusive of all learners</b>", "In practice, this means:", "- assessment against standards provides opportunities for all learners to achieve their best", "- assessment activities are free of bias." ],
        "children" : [ ]
      } ]
    }, {
      "name" : "10.3 Reporting",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "Reporting is the process of providing feedback to students, parents and other teachers about students’ progress.", "Teachers can use evidence gathered from assessment to extend the process of assessment for learning into their assessment of learning. In a standards-referenced framework this involves teachers in making professional judgements about student achievement at key points in the learning cycle. These may be at the end of a year or stage, when schools may wish to report differentially on the levels of knowledge, understanding and skills demonstrated by students.", "Descriptions of levels of achievement for Stage 4 and Stage 5 in Music have been developed to provide schools with a useful tool to report consistent information about student achievement to students and parents, and to the next teacher to help to plan the next steps in the learning process. These describe observable and measurable features of student achievement at the end of a stage, within the indicative hours of study. Descriptions of levels of achievement provide a common language for reporting.", "At Stage 5 there are six levels of achievement. Level 6 describes a very high level of achievement in relation to course objectives and outcomes. Level 2 describes satisfactory achievement, while the level 1 description will help identify students who are progressing towards the outcomes for the stage.", "At the end of Year 10, teachers of Music Years 7-10 will make an on-balance judgement, based on the available assessment evidence, to match each student’s achievement to a level description. This level will be reported on the student’s School Certificate Record of Achievement.", "At Stage 4 there are four levels of achievement. Level 4 describes a very high level of achievement; levels 2 and 3 describe satisfactory and high achievement that should provide a solid foundation for the next stage of learning. The level 1 description will help identify students who are progressing towards the outcomes for the stage.", "For students undertaking Life Skills outcomes and content in Years 7-10, the content listed for each identified Life Skills outcome forms the basis of the learning opportunities for these students. It also provides examples of activities on which teachers can base judgements to report student progress in relation to individual learning goals." ],
      "children" : [ ]
    }, {
      "name" : "10.4 Choosing Assessment Strategies",
      "style" : "LevelB",
      "type" : null,
      "description" : [ "Planning for assessment is integral to programming for teaching and learning. In a standards-referenced framework, teachers assess student performance on tasks in relation to syllabus outcomes and make on-balance judgements about student achievement. Assessment relies on the professional judgement of the teacher and is based on reliable data acquired in a fair and challenging environment, from multiple performances in a variety of contexts. Assessment is fundamental for furthering student learning.", "In planning programs, teachers, individually and collaboratively, review the syllabus and standards materials. They use these materials to describe for themselves what students should know and be able to do at a particular stage, and they consider the kinds of evidence their students could produce to show they have learnt what they needed to learn.", "Students are provided with a description of the learning expected to be accomplished, opportunities to discuss the criteria on which judgements will be based, time to learn, and where possible, examples of what that learning looks like.", "Assessment is used to determine the students’ initial knowledge, understanding and skills, to monitor student progress and to collect information to report student achievement. The assessment cycle is continuous; students receive and give themselves feedback on what they have learnt, and what needs to be done to continue their learning. Students gain information about their learning through feedback from teachers and from self-assessment and peer assessment. The challenge and complexity of assessment tasks increase to enable students to develop evaluative independence as they assess their own knowledge, understanding and skills, and determine ways to improve their learning.", "Teachers of Music should employ a range of assessment strategies to ensure that information is being gathered regarding the knowledge and understanding that are being acquired, and the skills that are being developed. Strategies should be appropriate to the outcomes being addressed, be manageable in number and be supportive of the learning process. Teachers could work collaboratively in planning appropriate assessment strategies. Working collaboratively leads teachers to develop a shared understanding of the syllabus standards and also supports teachers in making consistent and comparable judgements of student achievement in relation to these standards.", "In planning for assessment in Music it is important for teachers to consider:", "<li>the requirements of the syllabus</li>", "<li>the accessibility of the proposed activity in terms of language requirements</li>", "<li>the appropriateness of the challenge presented to individual students</li>", "<li>resource availability</li>", "<li>how the task will be administered</li>", "<li>the way in which feedback will be provided.</li>", "In planning for assessment, teachers of Music need to consider how results will be recorded, with a view to ensuring that there is sufficient and appropriate information collected for making an on-balance holistic judgement of the standard achieved by the student at the end of the stage. The evidence collected should enable teachers of Music to make consistent judgements to meet the various reporting requirements that the system, school and community may have.", "Music particularly lends itself to the following assessment techniques:" ],
      "children" : [ {
        "name" : "Performance",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Performance is an integral part of music and is one of the learning experiences. It allows students to demonstrate their knowledge, understanding and skills in the musical concepts as well as their own musical skills. Performances can occur in solo and/or ensemble situations; these may be performances of their own compositions as well as the performance of others’ compositions.", "When performance is used for assessment purposes, students could be assessed on their ability to demonstrate their:", "<li>understanding of solo and/or ensemble playing</li>", "<li>understanding of the musical style, period or genre being studied</li>", "<li>understanding of the manipulation of musical concepts in the context of live performance</li>", "<li>interpretation of a range of repertoire</li>", "<li>improvisation skills.</li>" ],
        "children" : [ ]
      }, {
        "name" : "Composition",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Composition is an integral part of music and is one of the learning experiences. It allows students to demonstrate their knowledge, understanding and skills in the musical concepts through exploring, experimenting, improvising, arranging and composing in a range of styles, periods and genres. Composition allows students to explore the capabilities of instruments and provides students with the opportunity to explore various forms of notation appropriate to various musical contexts.", "When composition is used for assessment purposes, students could be assessed on their ability to demonstrate their:", "<li>understanding of the manipulation of musical concepts in the context of creating music</li>", "<li>ability to notate compositions, making choices as to the most appropriate method to use</li>", "<li>use of technologies in the composition process</li>", "<li>ability to structure musical works</li>", "<li>understanding of the stylistic features of a range of styles, periods and genres.</li>" ],
        "children" : [ ]
      }, {
        "name" : "Listening",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Listening is an integral part of music and is one of the learning experiences. It allows students to demonstrate their knowledge, understanding and skills in the musical concepts through the analysis, comparison and discussion of music from a range of musical styles, periods and genres. Listening fosters an awareness of the social, cultural and historical contexts that music as an artform exists in. It provides a pathway to musical literacy through score reading, interpretation and analysis.", "When listening is used for assessment purposes, students could be assessed on their ability to demonstrate their:", "<li>understanding of how composers have manipulated the musical concepts in various styles, periods and genres</li>", "<li>analytical and comparative skills when investigating music in various styles, periods and genres</li>", "<li>aural skills</li>", "<li>understanding of scoring techniques, styles and conventions</li>", "<li>ability to interpret a variety of musical scores and musical notation</li>", "<li>ability to apply appropriate terminology when analysing music, either through aural or written form.</li>" ],
        "children" : [ ]
      }, {
        "name" : "Projects and presentations",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Projects and presentations can form an important part of an assessment schedule. They can \nbe used to develop analytical skills, organisational skills and problem-solving strategies. \nThey may take the form of research tasks and assignments that use a variety of primary \nand secondary sources and may be delivered in oral and/or written form, or with the use of tools such as multimedia technologies. These presentations could focus on critiques of performances, descriptive profiles of composers’ works, interviews, debates and viva voces." ],
        "children" : [ ]
      }, {
        "name" : "Peer assessment",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "Music encourages the active involvement of students in the learning process. Opportunities exist for individual and collaborative work. Activities involving peer assessment might include evaluating the contribution of individuals to a group task such as a performance or composition, and reflecting on a peer performances and compositions." ],
        "children" : [ ]
      }, {
        "name" : "Self-assessment",
        "style" : "LevelC0",
        "type" : null,
        "description" : [ "In Music students are encouraged to acquire skills to become self-directed learners. Opportunities exist for students to reflect on their progress towards the achievement of the syllabus outcomes. This reflection provides the basis for improving their learning. Developing self-assessment skills is an ongoing process, becoming increasingly more sophisticated and self-initiated as a student progresses." ],
        "children" : [ ]
      } ]
    } ]
  } ],
  "glossaries" : {
    "title" : "GLOSSARY",
    "glossaries" : [ ]
  }
}